[{"chunk_id": "c0", "text": "Fase 1: Investigación y Análisis de Requerimientos\nLa fase de investigación y análisis de requerimientos constituye el punto de partida para el desarrollo del componente Diseño de la Interfaz y Experiencia de Usuario (UX/UI) del simulador educativo con inteligencia artificial generativa. Su objetivo es comprender el contexto tecnológico, las necesidades de los usuarios y los elementos funcionales y no funcionales que definirán la estructura del sistema.\n\nEsta fase se centra en cuatro ejes principales:\n1. Identificación de herramientas de IA generativa aplicables al diseño y personalización del simulador.\n2. Análisis de usuarios y sus necesidades de interacción.\n3. Recopilación y organización de datos para el diseño adaptativo.\n4. Definición de los requerimientos funcionales, no funcionales y de experiencia de usuario de la interfaz.\n1. Investigación de herramientas de IA generativa\nEl si", "start": 0, "end": 900}, {"chunk_id": "c1", "text": "de los requerimientos funcionales, no funcionales y de experiencia de usuario de la interfaz.\n1. Investigación de herramientas de IA generativa\nEl simulador requiere integrar tecnologías de inteligencia artificial que permitan generar contenido educativo personalizado en función del nivel y ritmo de aprendizaje del estudiante. Por tanto, se investigaron herramientas y APIs de IA generativa relevantes en el contexto educativo y de desarrollo de interfaces.\nTras el análisis, se concluye que la combinación de Hugging Face + OpenAI API + LangChain es la opción más viable para la integración con la interfaz web, debido a su compatibilidad con frameworks frontend, soporte para despliegue escalable y ecosistema activo.\n2. Análisis de usuarios\nEl análisis de usuarios busca identificar las características, necesidades y comportamientos de las personas que interactuarán con la plataforma. Se apli", "start": 750, "end": 1650}, {"chunk_id": "c2", "text": "análisis de usuarios busca identificar las características, necesidades y comportamientos de las personas que interactuarán con la plataforma. Se aplicó un enfoque centrado en el usuario (Human-Centered Design) con base en entrevistas exploratorias, observación y revisión de experiencias de aprendizaje digital.\nPúblico objetivo: estudiantes universitarios, docentes e instituciones educativas que buscan personalizar el proceso de aprendizaje.\n3. Definición de requerimientos\n3.1 Requerimientos funcionales\n3.2 Requerimientos no funcionales\n4. Conclusiones de la fase\nLa fase de investigación y análisis permitió establecer una base sólida para el desarrollo del componente UX/UI. Se identificaron herramientas de IA generativa adecuadas, se comprendieron las necesidades de los usuarios y se definieron los requerimientos técnicos que guiarán las siguientes fases del proyecto. Con esta informació", "start": 1500, "end": 2400}, {"chunk_id": "c3", "text": "ndieron las necesidades de los usuarios y se definieron los requerimientos técnicos que guiarán las siguientes fases del proyecto. Con esta información, se procederá al diseño de prototipos de baja y alta fidelidad, asegurando que la solución propuesta sea tecnológicamente viable, pedagógicamente útil y centrada en el usuario.", "start": 2250, "end": 2578}]