[{"chunk_id": "c0", "text": "2.1 Metodología SCRUM\nPara desarrollar el componente de Diseño de la Interfaz y Experiencia de Usuario (UX/UI) se empleó el marco de trabajo ágil SCRUM, ya que permite avanzar por iteraciones cortas, revisar resultados con frecuencia y ajustar el producto a medida que se obtiene nueva retroalimentación. En otras palabras, en lugar de intentar “acertar” a la primera, se trabaja por incrementos: se planifica, se construye, se revisa lo logrado y se mejora en el siguiente ciclo. Este enfoque encaja bien con UX/UI porque el diseño se fortalece cuando se valida con usuarios y se refina de forma continua [1].\nDe acuerdo con Scrum.org, SCRUM se organiza mediante un conjunto de roles, eventos y artefactos que buscan asegurar transparencia del trabajo, inspección frecuente del avance y adaptación oportuna ante cambios [1]. En este componente, dichos elementos se aplicaron para ordenar la planific", "start": 0, "end": 900}, {"chunk_id": "c1", "text": "jo, inspección frecuente del avance y adaptación oportuna ante cambios [1]. En este componente, dichos elementos se aplicaron para ordenar la planificación semanal, mantener claridad sobre lo que se estaba construyendo y asegurar entregables verificables al final de cada sprint.\nA continuación, se presenta el framework general de SCRUM y, en tablas separadas, los elementos principales (equipo, eventos y artefactos) con su interpretación aplicada al componente UX/UI. Todas las definiciones y denominaciones empleadas se basan en la descripción de Scrum.org [1].\nFigura 2.1. Framework SCRUM (basado en Scrum.org) [1]\n\nTabla 2.1. Equipo SCRUM (basado en Scrum.org) [1]\n\nTabla 2.2. Eventos SCRUM (basado en Scrum.org) [1]\n\nTabla 2.3. Artefactos SCRUM (basado en Scrum.org) [1]\n\nTabla 2.4. Principios clave de SCRUM aplicados al componente (basado en Scrum.org) [1]\nReferencias\n[1] “What is Scrum?”,", "start": 750, "end": 1650}, {"chunk_id": "c2", "text": "M (basado en Scrum.org) [1]\n\nTabla 2.4. Principios clave de SCRUM aplicados al componente (basado en Scrum.org) [1]\nReferencias\n[1] “What is Scrum?”, Scrum.org. https://www.scrum.org/learning-series/what-is-scrum", "start": 1500, "end": 1712}]