[{"chunk_id": "c0", "text": "ESCUELA POLITÉCNICA NACIONAL\nFACULTAD DE INGENIERÍA DE SISTEMAS\nDESARROLLO DE UN SIMULADOR DE CLASES\nPERSONALIZADAS CON IA GENERATIVA PARA EL\nAPRENDIZAJE UNIVERSITARIO\nDISEÑO DE LA INTERFAZ Y EXPERIENCIA DE USUARIO (UX/UI)\nTRABAJO DE TITULACIÓN PREVIO A LA OBTENCIÓN DEL TÍTULO DE\nINGENIERO EN CIENCIAS DE LA COMPUTACIÓN\nHERNÁN DARÍO SÁNCHEZ TENELANDA\nhernan.sanchez@epn.edu.ec\nDIRECTOR: ENRIQUE ANDRÉS LARCO AMPUDIA, PhD.\nandres.larco@epn.edu.ec\nDMQ, diciembre 2025\nCERTIFICACIONES\nY o,HERNÁN DARÍO SÁNCHEZ TENELANDAdeclaro que el trabajo de integración curri-\ncular aquí descrito es de mi autoría; que no ha sido previamente presentado para ningún\ngrado o calificación profesional; y, que he consultado las referencias bibliográficas que se\nincluyen en este documento.\nAsimismo, declaro que he utilizado la herramienta de inteligencia artificial [CHATGPT] única-\nmente como apoyo en [BÚSQUEDA Y SÍN", "start": 0, "end": 900}, {"chunk_id": "c1", "text": "n en este documento.\nAsimismo, declaro que he utilizado la herramienta de inteligencia artificial [CHATGPT] única-\nmente como apoyo en [BÚSQUEDA Y SÍNTESIS DE INFORMACIÓN], sin atribuirle autoría,\ny que todo el contenido derivado ha sido revisado, validado y es de mi exclusiva responsa-\nbilidad.\nHERNÁN DARÍO SÁNCHEZ TENELANDA\nCertifico que el presente trabajo de integración curricular fue desarrollado porHERNÁN\nDARÍO SÁNCHEZ TENELANDA, bajo mi supervisión.\nENRIQUE ANDRÉS LARCO AMPUDIA, PhD\nDIRECTOR\nI\nDECLARACIÓN DE AUTORÍA\nA través de la presente declaración, afirmamos que el trabajo de integración curricular aquí\ndescrito, así como el (los) producto(s) resultante(s) del mismo, son públicos y estarán a\ndisposición de la comunidad a través del repositorio institucional de la Escuela Politécnica\nNacional; sin embargo, la titularidad de los derechos patrimoniales nos corresponde a los\nautor", "start": 750, "end": 1650}, {"chunk_id": "c2", "text": "el repositorio institucional de la Escuela Politécnica\nNacional; sin embargo, la titularidad de los derechos patrimoniales nos corresponde a los\nautores que hemos contribuido en el desarrollo del presente trabajo; observando para el\nefecto las disposiciones establecidas por el órgano competente en propiedad intelectual, la\nnormativa interna y demás normas.\nHERNÁN DARÍO SÁNCHEZ TENELANDA\nENRIQUE ANDRÉS LARCO AMPUDIA, PhD.\nCARLOS ANDRÉS CÓRDOVA ACARO\nMICHAEL ANDRÉS PILLAGA SOSA\nCARLA ANNAI RUIZ ACEVEDO\nII\nDEDICATORIA\n(Opcional)\nIII\nAGRADECIMIENTOS\n(Opcional)\nIV\nÍNDICE DE CONTENIDO\nCERTIFICACIONES. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .I\nDECLARACIÓN DE AUTORÍA. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .I\nDEDICATORIA. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .III\nAGRADECIMIENTOS. . . . . . . . . . . . . . .", "start": 1500, "end": 2400}, {"chunk_id": "c3", "text": ". . . . .I\nDEDICATORIA. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .III\nAGRADECIMIENTOS. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .IV\nÍNDICE DE CONTENIDO. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .V\nRESUMEN. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .VII\nABSTRACT. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .VIII\n1 DESCRIPCIÓN DEL COMPONENTE DESARROLLADO . . . . . . . . . . . . . 1\n1.1 Objetivo general . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n1.2 Objetivos específicos . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n1.3 Alcance . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n1.4 Marco Teórico . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .", "start": 2250, "end": 3150}, {"chunk_id": "c4", "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n1.4 Marco Teórico . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n1.4.1 Experiencia de Usuario (UX) . . . . . . . . . . . . . . . . . . . . . . . 3\n1.4.2 Interfaz de Usuario (UI) . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n1.4.3 Inteligencia Artificial Generativa . . . . . . . . . . . . . . . . . . . . . . 6\n1.4.4 APIs . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 7\n1.4.5 IA y Educación en Universidades . . . . . . . . . . . . . . . . . . . . . 8\n1.4.6 Interacción Humano–Computador (HCI) . . . . . . . . . . . . . . . . . 9\n2 METODOLOGÍA . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n2.1 Metodología SCRUM . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n2.1.1 Definición y asignación de roles . . . . . . . . . . . .", "start": 3000, "end": 3900}, {"chunk_id": "c5", "text": ".1 Metodología SCRUM . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n2.1.1 Definición y asignación de roles . . . . . . . . . . . . . . . . . . . . . 15\n2.1.2 Planificación y organización de los sprints . . . . . . . . . . . . . . . . 16\n2.2 Tecnologías Utilizadas . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 17\n2.2.1 Herramientas Utilizadas . . . . . . . . . . . . . . . . . . . . . . . . . . 18\n2.3 Etapa de Desarrollo . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19\n2.3.1 Sprint 0: Análisis inicial y definición del enfoque UX/UI . . . . . . . . . 19\n2.3.2 Sprint 1: Análisis de herramientas de IA generativa y levantamiento de\nrequerimientos . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19\nV\n2.3.3 Sprint 2: Diseño de prototipos de baja fidelidad y estructura de nave-\ngación . . . . . . . . . . . . . . . . . . . . . . . .", "start": 3750, "end": 4650}, {"chunk_id": "c6", "text": ". . . . . . . 19\nV\n2.3.3 Sprint 2: Diseño de prototipos de baja fidelidad y estructura de nave-\ngación . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25\n3 RESULTADOS, CONCLUSIONES Y RECOMENDACIONES . . . . . . . . . . . 27\n3.1 Resultados . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 27\n3.2 Conclusiones . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 28\n3.3 Recomendaciones . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 28\n4 REFERENCIAS BIBLIOGRÁFICAS . . . . . . . . . . . . . . . . . . . . . . . . . 29\n5 ANEXOS . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 32\nANEXO I: Aplicación Movil. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 32\nANEXO II: Aplicación Web. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 33\nANEXO III: Págin", "start": 4500, "end": 5400}, {"chunk_id": "c7", "text": ". . . . . . . . . . . . . . . . . . . 32\nANEXO II: Aplicación Web. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 33\nANEXO III: Página Web. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 34\nVI\nRESUMEN\nAntecedentes:\nObjetivo:\nMetodología:\nResultados:\nConclusiones:\nCuando termines de escribir tu resumen, elimina las 5 palabras anteriores que están en\nnegrita.\n(Maximo 250 palabras)\nPALABRAS CLAVE:palabra 1, palabra 2,....., palabra 6.\nVII\nABSTRACT\nBackground:\nObjective:\nMethods:\nResults:\nConclusions:\nWhen you finish writing your abstract, delete the previous five bold words.\n(Maximo 250 palabras).\nKEYWORDS:word1, word2, . . . , word6.\nVIII\n1 DESCRIPCIÓN DEL COMPONENTE DESARROLLADO\nEl componente desarrollado estuvo centrado al diseño e implementación de la interfaz grá-\nfica y de la experiencia de usuario (UX/UI) del Simulador de Clases Personalizadas co", "start": 5250, "end": 6150}, {"chunk_id": "c8", "text": "o estuvo centrado al diseño e implementación de la interfaz grá-\nfica y de la experiencia de usuario (UX/UI) del Simulador de Clases Personalizadas con\nInteligencia Artificial Generativa. Debido a que esta herramienta está pensada para apoyar\na estudiantes universitarios con diferentes niveles de conocimiento y formas de aprendizaje,\nfue necesario plantear una interfaz que resultara clara, accesible y cómoda de utilizar desde\nel primer uso.\nDesde las primeras etapas del proyecto se tuvo presente que la interfaz no debía limitarse a\nun diseño visual atractivo. Su función principal era servir como un puente entre el estudian-\nte y el sistema, facilitando la interacción y el acceso a los contenidos sin generar confusión\no dificultades innecesarias. Con este enfoque, se inició una fase de análisis en la que se\nrevisaron distintas plataformas educativas y herramientas basadas en inteligencia", "start": 6000, "end": 6900}, {"chunk_id": "c9", "text": "rias. Con este enfoque, se inició una fase de análisis en la que se\nrevisaron distintas plataformas educativas y herramientas basadas en inteligencia artificial\ngenerativa, con el objetivo de identificar prácticas efectivas y elementos que pudieran adap-\ntarse al contexto del simulador.\nA partir de este análisis se definieron las funcionalidades principales de la plataforma y se\ndesarrollaron prototipos con un enfoque centrado en el usuario. Estos diseños preliminares\npriorizaron una navegación sencilla y una estructura organizada, permitiendo que los es-\ntudiantes accedieran de forma rápida a secciones clave como las clases personalizadas,\nla retroalimentación inmediata y los ejercicios adaptativos. Se prestó especial atención a\naspectos como la legibilidad de los textos, el contraste de colores, el uso adecuado de íco-\nnos y la distribución clara de la información, buscando una experie", "start": 6750, "end": 7650}, {"chunk_id": "c10", "text": "omo la legibilidad de los textos, el contraste de colores, el uso adecuado de íco-\nnos y la distribución clara de la información, buscando una experiencia de uso coherente y\ncomprensible.\nDurante el proceso de desarrollo se realizaron pruebas de usabilidad con estudiantes uni-\nversitarios, las cuales resultaron fundamentales para evaluar el funcionamiento real de la\ninterfaz. Estas pruebas permitieron observar directamente cómo los usuarios interactuaban\ncon la plataforma, identificar dificultades recurrentes y recoger sugerencias de mejora. A\npartir de estos resultados, se realizaron ajustes en distintos elementos del diseño, como la\nubicación de ciertos componentes, la claridad de botones e instrucciones y la optimización\nde los tiempos de carga.\nLa interfaz final permite a los estudiantes explorar de manera sencilla el contenido gene-\nrado por la inteligencia artificial, solicitar exp", "start": 7500, "end": 8400}, {"chunk_id": "c11", "text": "e carga.\nLa interfaz final permite a los estudiantes explorar de manera sencilla el contenido gene-\nrado por la inteligencia artificial, solicitar explicaciones adicionales cuando lo consideran\nnecesario y practicar mediante ejercicios que se adaptan a su ritmo de aprendizaje. Todo\n1\nello se presenta en un entorno visual ordenado y funcional, diseñado para reducir la carga\ncognitiva y facilitar el proceso de aprendizaje.\nEste componente fue esencial para el correcto funcionamiento del simulador, ya que per-\nmitió transformar la complejidad técnica del sistema en una herramienta accesible y fácil\nde utilizar. Además, cada etapa del desarrollo fue documentada de forma detallada, lo que\nfacilitará futuras mejoras, ajustes o integraciones con otras plataformas educativas.\n1.1 Objetivo general\nDiseñar una interfaz gráfica accesible y funcional para el Simulador de Clases Personaliza-\ndas con", "start": 8250, "end": 9150}, {"chunk_id": "c12", "text": "tras plataformas educativas.\n1.1 Objetivo general\nDiseñar una interfaz gráfica accesible y funcional para el Simulador de Clases Personaliza-\ndas con IA generativa, que facilite la experiencia de usuario y la interacción entre estudian-\ntes y el sistema.\n1.2 Objetivos específicos\n1. Investigar y analizar herramientas de inteligencia artificial generativa para identificar\nbuenas prácticas en diseño de interfaces.\n2. Diseñar e implementar una interfaz gráfica que permita navegación fluida, interacción\ny visualización del contenido generado.\n3. Realizar pruebas de usabilidad con estudiantes universitarios, para mejorar la expe-\nriencia de usuario e identificar posibles mejoras.\n1.3 Alcance\nEl alcance del componente desarrollado incluyó la construcción y puesta en funcionamiento\nde la interfaz gráfica y la experiencia de usuario (UX/UI) del simulador de clases persona-\nlizadas con inteligenc", "start": 9000, "end": 9900}, {"chunk_id": "c13", "text": "trucción y puesta en funcionamiento\nde la interfaz gráfica y la experiencia de usuario (UX/UI) del simulador de clases persona-\nlizadas con inteligencia artificial generativa, de acuerdo con las directrices establecidas en\nel Plan de Trabajo de Integración Curricular. Este módulo fue concebido como el principal\npunto de interacción entre los estudiantes y el sistema, por lo que su diseño se orientó a\nofrecer una experiencia clara, accesible y alineada con los objetivos formativos del proyecto.\nDentro de las actividades realizadas se contempló, en primer lugar, la revisión de distintas\n2\nherramientas de inteligencia artificial generativa, con el fin de analizar su posible integra-\nción a nivel de interfaz. Paralelamente, se llevó a cabo un análisis de las necesidades de\ninteracción de estudiantes universitarios, lo que permitió identificar patrones de uso y ex-\npectativas frente a este ti", "start": 9750, "end": 10650}, {"chunk_id": "c14", "text": "nálisis de las necesidades de\ninteracción de estudiantes universitarios, lo que permitió identificar patrones de uso y ex-\npectativas frente a este tipo de plataformas. Con base en esta información, se definieron los\nrequerimientos técnicos y funcionales que guiaron el desarrollo del componente.\nA partir de los requerimientos establecidos, se elaboraron prototipos de baja y alta fidelidad,\nlos cuales sirvieron para validar progresivamente las decisiones de diseño. Durante esta\netapa se priorizó la facilidad de uso, una navegación estructurada de manera lógica y una\npresentación visual clara del contenido generado por la inteligencia artificial, procurando\nque el acceso a las funcionalidades del simulador resultara intuitivo para el usuario.\nLa fase de implementación se llevó a cabo utilizando tecnologías web actuales, lo que per-\nmitió una integración adecuada con los módulos principales", "start": 10500, "end": 11400}, {"chunk_id": "c15", "text": "La fase de implementación se llevó a cabo utilizando tecnologías web actuales, lo que per-\nmitió una integración adecuada con los módulos principales del simulador, tales como la\ngeneración de clases, la retroalimentación automática y el sistema de evaluación adaptati-\nva. Adicionalmente, se desarrolló una interfaz responsiva que garantiza un funcionamiento\ncorrecto en distintos dispositivos, incluyendo computadoras de escritorio, teléfonos móviles\ny tabletas, favoreciendo su uso en diversos contextos universitarios.\nComo parte del proceso de desarrollo, se realizaron evaluaciones de usabilidad con es-\ntudiantes universitarios, orientadas a observar su desempeño en tareas específicas y a\nidentificar posibles dificultades de interacción. Los resultados obtenidos sirvieron como ba-\nse para aplicar mejoras de manera iterativa, ajustando elementos visuales, optimizando los\ntiempos de carga", "start": 11250, "end": 12150}, {"chunk_id": "c16", "text": "s resultados obtenidos sirvieron como ba-\nse para aplicar mejoras de manera iterativa, ajustando elementos visuales, optimizando los\ntiempos de carga y reforzando la claridad de los componentes interactivos. Estas acciones\ncontribuyeron a fortalecer la experiencia general ofrecida por la plataforma.\n1.4 Marco Teórico\n1.4.1 Experiencia de Usuario (UX)\nLa Experiencia de Usuario (UX, por sus siglas en inglés) hace referencia a las percep-\nciones, emociones y respuestas que una persona desarrolla antes, durante y después de\ninteractuar con un sistema digital. Este concepto no se limita a la facilidad de uso, sino que\nincorpora factores cognitivos, emocionales y contextuales que influyen directamente en la\naceptación y efectividad de una solución tecnológica [1].\n3\nDe acuerdo con la norma ISO 9241-210, la UX se define como el resultado de las percep-\nciones y respuestas del usuario derivadas", "start": 12000, "end": 12900}, {"chunk_id": "c17", "text": "n tecnológica [1].\n3\nDe acuerdo con la norma ISO 9241-210, la UX se define como el resultado de las percep-\nciones y respuestas del usuario derivadas del uso real o anticipado de un sistema, conside-\nrando emociones, creencias, preferencias, comodidad y logros personales. Esta definición\ndestaca que la experiencia no depende únicamente de la interfaz gráfica, sino también del\ncontexto de uso y del estado interno del usuario, como sus conocimientos previos y expec-\ntativas [2].\nEn el desarrollo de software, la experiencia de usuario se ha convertido en un factor clave de\ncalidad. Un sistema puede ser técnicamente correcto, pero si genera confusión, frustración\no sobrecarga cognitiva, su adopción será limitada. En entornos educativos digitales, una\nmala UX puede afectar la motivación del estudiante y reducir la continuidad del proceso\nde aprendizaje, mientras que una experiencia bien diseñ", "start": 12750, "end": 13650}, {"chunk_id": "c18", "text": "s, una\nmala UX puede afectar la motivación del estudiante y reducir la continuidad del proceso\nde aprendizaje, mientras que una experiencia bien diseñada favorece la participación y el\ncompromiso académico [3].\nEs importante diferenciar la UX de la usabilidad y de la interfaz de usuario (UI). La usabilidad\nse enfoca en qué tan fácil resulta aprender y utilizar un sistema, mientras que la UX abarca\nuna visión más amplia que incluye la utilidad percibida, la satisfacción emocional y el valor\nque el usuario atribuye a la interacción. De esta manera, la interfaz actúa como un medio,\npero no garantiza por sí sola una experiencia positiva.\nDesde un enfoque multidisciplinario, la experiencia de usuario integra aportes de la interac-\nción humano-computador, la psicología cognitiva, el diseño de interacción y la arquitectura\nde la información. Esta convergencia permite diseñar sistemas alineados", "start": 13500, "end": 14400}, {"chunk_id": "c19", "text": "mputador, la psicología cognitiva, el diseño de interacción y la arquitectura\nde la información. Esta convergencia permite diseñar sistemas alineados con los modelos\nmentales de los usuarios y reducir la carga cognitiva, aspecto especialmente relevante en\nplataformas educativas apoyadas por inteligencia artificial.\nEn el contexto del simulador de clases personalizadas con IA generativa propuesto en es-\nte proyecto, la UX cumple un rol estratégico. Una experiencia clara, coherente y accesible\nfacilita que los estudiantes comprendan el funcionamiento del sistema, confíen en la per-\nsonalización del contenido y utilicen de forma efectiva la retroalimentación automática y\nla evaluación adaptativa. Por ello, la UX debe entenderse como un proceso continuo de\nevaluación y mejora, basado en la retroalimentación de usuarios reales.\n4\n1.4.2 Interfaz de Usuario (UI)\nLa Interfaz de Usuario (UI, por", "start": 14250, "end": 15150}, {"chunk_id": "c20", "text": "continuo de\nevaluación y mejora, basado en la retroalimentación de usuarios reales.\n4\n1.4.2 Interfaz de Usuario (UI)\nLa Interfaz de Usuario (UI, por sus siglas en inglés) constituye el punto de contacto directo\nentre las personas y los sistemas informáticos. Es el espacio donde se materializa la in-\nteracción humano–computador y donde el usuario interpreta qué puede hacer un sistema\ny cómo hacerlo. Desde esta perspectiva, la interfaz no es un elemento accesorio, sino un\ncomponente esencial que condiciona la comprensión, el uso y la aceptación de cualquier\nproducto digital [4].\nDiversos autores coinciden en que una interfaz bien diseñada permite que el usuario actúe\nde manera natural, sin necesidad de comprender los aspectos técnicos que subyacen al sis-\ntema. Para el usuario final, la interfaz representa el sistema en su totalidad; si la interacción\nresulta confusa o poco clara, el sist", "start": 15000, "end": 15900}, {"chunk_id": "c21", "text": "byacen al sis-\ntema. Para el usuario final, la interfaz representa el sistema en su totalidad; si la interacción\nresulta confusa o poco clara, el sistema será percibido como ineficiente, independientemen-\nte de su correcto funcionamiento interno [5].\nLa UI se compone de elementos visuales e interactivos como botones, menús, iconos, textos\ny mecanismos de retroalimentación que guían al usuario en la ejecución de tareas. Estos\nelementos deben organizarse de forma coherente y consistente, facilitando la creación de\nun modelo mental claro que permita anticipar el comportamiento del sistema. Cuando la\ninterfaz respeta las expectativas del usuario, la interacción se vuelve fluida y reduce la carga\ncognitiva durante el uso [6].\nUn aspecto clave del diseño de interfaz es reconocer la diversidad de usuarios. Las perso-\nnas difieren en sus capacidades físicas, cognitivas y en sus niveles de experi", "start": 15750, "end": 16650}, {"chunk_id": "c22", "text": "l diseño de interfaz es reconocer la diversidad de usuarios. Las perso-\nnas difieren en sus capacidades físicas, cognitivas y en sus niveles de experiencia con la\ntecnología. Por ello, una UI efectiva debe ser flexible, accesible y tolerante al error, permi-\ntiendo tanto a usuarios novatos como experimentados interactuar con el sistema de manera\nsegura y eficiente [7].\nAsimismo, la interfaz cumple un rol comunicativo. A través de metáforas visuales, colores,\njerarquías y mensajes claros, la UI transmite el estado del sistema y orienta al usuario\nen cada paso de la interacción. Una retroalimentación adecuada fortalece la sensación de\ncontrol y confianza, elementos fundamentales para una experiencia de uso positiva.\nEn el contexto del simulador de clases personalizadas con inteligencia artificial propuesto\nen este proyecto, la interfaz de usuario adquiere especial relevancia. Una UI clara", "start": 16500, "end": 17400}, {"chunk_id": "c23", "text": "or de clases personalizadas con inteligencia artificial propuesto\nen este proyecto, la interfaz de usuario adquiere especial relevancia. Una UI clara y profe-\nsional permite que los estudiantes comprendan las funcionalidades del sistema, accedan al\ncontenido de forma intuitiva y aprovechen los recursos de personalización sin sentirse abru-\n5\nmados por la tecnología. De esta manera, la interfaz actúa como un puente que humaniza\nla tecnología y facilita el proceso de aprendizaje.\n1.4.3 Inteligencia Artificial Generativa\nLa Inteligencia Artificial Generativa (IAG) es una rama de la inteligencia artificial orientada a\nla creación automática de contenido nuevo a partir del aprendizaje de grandes volúmenes\nde datos. A diferencia de otros enfoques de la IA, cuyo objetivo principal es clasificar, pre-\ndecir o recomendar, la IAG se caracteriza por su capacidad para producir textos, imágenes,\naudi", "start": 17250, "end": 18150}, {"chunk_id": "c24", "text": "de la IA, cuyo objetivo principal es clasificar, pre-\ndecir o recomendar, la IAG se caracteriza por su capacidad para producir textos, imágenes,\naudio, video o código que resultan coherentes y comparables a los generados por seres\nhumanos [8].\nEl desarrollo reciente de la IA generativa ha sido posible gracias a la combinación de tres\nfactores clave: el aumento de la capacidad de cómputo, la disponibilidad de grandes con-\njuntos de datos y el avance de arquitecturas de aprendizaje profundo, especialmente los\nmodelos basados en redes neuronales de tipo Transformer. Estos modelos aprenden patro-\nnes complejos del lenguaje, la imagen o el sonido, y posteriormente los utilizan para generar\nnuevas salidas a partir de instrucciones expresadas en lenguaje natural, conocidas como\nprompts[9].\nUno de los ejemplos más representativos de la IA generativa aplicada al lenguaje natural\nes ChatGPT, un m", "start": 18000, "end": 18900}, {"chunk_id": "c25", "text": "lenguaje natural, conocidas como\nprompts[9].\nUno de los ejemplos más representativos de la IA generativa aplicada al lenguaje natural\nes ChatGPT, un modelo de lenguaje desarrollado por OpenAI basado en la arquitectura\nGPT (Generative Pre-trained Transformer). Este tipo de sistemas es capaz de mantener\ndiálogos, responder preguntas, generar explicaciones, redactar textos académicos prelimi-\nnares o crear ejercicios educativos, lo que ha impulsado su adopción en ámbitos como la\neducación superior y la formación continua [10]. Otros ejemplos similares incluyen Gemini\n(Google) y Claude (Anthropic), que persiguen objetivos equivalentes en cuanto a genera-\nción de texto y asistencia conversacional.\nEn el ámbito visual, la IA generativa ha dado lugar a herramientas capaces de crear imá-\ngenes originales a partir de descripciones textuales. Modelos como DALL·E, Midjourney\no Stable Diffusion util", "start": 18750, "end": 19650}, {"chunk_id": "c26", "text": "gar a herramientas capaces de crear imá-\ngenes originales a partir de descripciones textuales. Modelos como DALL·E, Midjourney\no Stable Diffusion utilizan redes generativas entrenadas con grandes colecciones de imá-\ngenes para sintetizar ilustraciones, diagramas o material gráfico con distintos estilos. Estas\naplicaciones han ampliado las posibilidades creativas en diseño, comunicación y educación,\nal permitir la generación rápida de recursos visuales adaptados a contextos específicos [11].\n6\nAsimismo, la IA generativa se ha extendido a la producción de música, audio y código\nfuente. Herramientas como Jukebox o MusicLM permiten generar composiciones musicales,\nmientras que sistemas como GitHub Copilot asisten en la escritura de código, sugiriendo\nfragmentos de programas basados en el contexto y las buenas prácticas aprendidas durante\nsu entrenamiento. Estos ejemplos evidencian el carácte", "start": 19500, "end": 20400}, {"chunk_id": "c27", "text": "riendo\nfragmentos de programas basados en el contexto y las buenas prácticas aprendidas durante\nsu entrenamiento. Estos ejemplos evidencian el carácter transversal de la IAG y su impacto\nen múltiples dominios profesionales [9].\nEn el contexto educativo, la inteligencia artificial generativa presenta un potencial significa-\ntivo para la personalización del aprendizaje. Diversos estudios han demostrado que estas\ntecnologías pueden utilizarse para generar explicaciones adaptadas al nivel del estudian-\nte, proponer ejemplos prácticos, ofrecer retroalimentación inmediata y apoyar procesos de\nautoaprendizaje. En educación superior, el uso controlado de sistemas como ChatGPT ha\nmostrado altos niveles de satisfacción estudiantil y una percepción positiva de su utilidad co-\nmo apoyo al estudio, siempre que se acompañe de orientación pedagógica y pensamiento\ncrítico [12].\nNo obstante, la adopción", "start": 20250, "end": 21150}, {"chunk_id": "c28", "text": "sitiva de su utilidad co-\nmo apoyo al estudio, siempre que se acompañe de orientación pedagógica y pensamiento\ncrítico [12].\nNo obstante, la adopción de la IA generativa también plantea desafíos relevantes. Entre\nellos se encuentran la posible generación de información incorrecta, los sesgos derivados\nde los datos de entrenamiento, las implicaciones éticas y legales, y el riesgo de una depen-\ndencia excesiva por parte de los usuarios. Por este motivo, diversos autores coinciden en la\nnecesidad de integrar estas tecnologías de manera responsable, promoviendo su uso como\nherramienta de apoyo y no como sustituto del juicio humano [13].\n1.4.4 APIs\nLas Interfaces de Programación de Aplicaciones, comúnmente conocidas como APIs (Appli-\ncation Programming Interfaces), constituyen un componente fundamental en la arquitectura\ndel software moderno. Una API puede entenderse como un conjunto de regla", "start": 21000, "end": 21900}, {"chunk_id": "c29", "text": "ramming Interfaces), constituyen un componente fundamental en la arquitectura\ndel software moderno. Una API puede entenderse como un conjunto de reglas, definicio-\nnes y protocolos que permiten que distintos sistemas informáticos se comuniquen entre\nsí de forma estructurada y controlada. En lugar de interactuar directamente con la imple-\nmentación interna de una aplicación, los sistemas consumidores utilizan la API como un\nintermediario que expone únicamente las funcionalidades necesarias, garantizando así un\nmayor nivel de abstracción y desacoplamiento [14].\nDesde una perspectiva conceptual, las APIs facilitan la interoperabilidad entre aplicacio-\nnes heterogéneas, incluso cuando estas han sido desarrolladas en diferentes lenguajes de\n7\nprogramación o se ejecutan en plataformas distintas. Esta capacidad ha sido clave para\nel crecimiento de ecosistemas digitales complejos, donde servicio", "start": 21750, "end": 22650}, {"chunk_id": "c30", "text": "ogramación o se ejecutan en plataformas distintas. Esta capacidad ha sido clave para\nel crecimiento de ecosistemas digitales complejos, donde servicios web, aplicaciones mó-\nviles y sistemas empresariales requieren intercambiar información de manera constante y\nconfiable [15]. En este contexto, las APIs permiten automatizar procesos, reutilizar funcio-\nnalidades y reducir significativamente el esfuerzo de desarrollo.\nUno de los estilos más extendidos en el diseño de APIs es el enfoque REST (Representa-\ntional State Transfer), el cual se apoya en el protocolo HTTP y en el uso de recursos identifi-\ncados mediante URLs. Las APIs REST emplean métodos estándar como GET, POST, PUT\ny DELETE para realizar operaciones sobre los recursos, lo que favorece la simplicidad, la\nescalabilidad y la comprensión por parte de los desarrolladores [16].\nEn términos prácticos, las APIs se utilizan de manera co", "start": 22500, "end": 23400}, {"chunk_id": "c31", "text": "rece la simplicidad, la\nescalabilidad y la comprensión por parte de los desarrolladores [16].\nEn términos prácticos, las APIs se utilizan de manera cotidiana en múltiples escenarios. Por\nejemplo, cuando una aplicación móvil consulta datos almacenados en un servidor, cuan-\ndo una plataforma educativa recupera información de usuarios autenticados o cuando un\nsistema incorpora servicios externos como mapas, pagos en línea o motores de inteligen-\ncia artificial. En todos estos casos, la API actúa como un contrato que define cómo deben\nenviarse las solicitudes y cómo se estructuran las respuestas, generalmente en formatos\ncomo JSON o XML [17].\nDesde el punto de vista estratégico, las APIs no solo cumplen una función técnica, sino que\ntambién representan un activo de valor para las organizaciones. Una API bien diseñada\npuede convertirse en un habilitador de innovación, al permitir que terceros", "start": 23250, "end": 24150}, {"chunk_id": "c32", "text": "resentan un activo de valor para las organizaciones. Una API bien diseñada\npuede convertirse en un habilitador de innovación, al permitir que terceros desarrollen nue-\nvas aplicaciones o servicios sobre una plataforma existente, al mismo tiempo que mejora la\nmantenibilidad y evolución de los sistemas [18].\n1.4.5 IA y Educación en Universidades\nLa incorporación de la inteligencia artificial (IA), y en particular de la inteligencia artificial\ngenerativa, en la educación universitaria ha generado un profundo debate académico y pe-\ndagógico. Las universidades se enfrentan al desafío de integrar estas tecnologías en sus\nprocesos de enseñanza y aprendizaje sin comprometer principios fundamentales como el\npensamiento crítico, la autonomía intelectual y la integridad académica. En este contexto,\nla IA no debe entenderse únicamente como una herramienta técnica, sino como un fenó-\nmeno que transfo", "start": 24000, "end": 24900}, {"chunk_id": "c33", "text": "ual y la integridad académica. En este contexto,\nla IA no debe entenderse únicamente como una herramienta técnica, sino como un fenó-\nmeno que transforma las dinámicas educativas y redefine el rol tanto del docente como del\nestudiante [19].\n8\nDiversos estudios señalan que la IA generativa puede actuar como un apoyo significativo en\nla educación superior, especialmente en entornos virtuales y semipresenciales. Herramien-\ntas basadas en modelos generativos permiten ofrecer retroalimentación inmediata, generar\nexplicaciones personalizadas y apoyar la gestión del aprendizaje autónomo. Estas capaci-\ndades resultan particularmente relevantes en universidades, donde los estudiantes deben\nasumir un papel activo en la construcción de su conocimiento y en la autorregulación de su\nproceso formativo [20].\nNo obstante, la literatura académica advierte que el uso indiscriminado de la IA generativa\npue", "start": 24750, "end": 25650}, {"chunk_id": "c34", "text": "y en la autorregulación de su\nproceso formativo [20].\nNo obstante, la literatura académica advierte que el uso indiscriminado de la IA generativa\npuede limitar el desarrollo del pensamiento crítico si no existe una mediación pedagógica\nadecuada. Investigaciones recientes destacan que el verdadero valor educativo de estas\ntecnologías no reside en la automatización de respuestas, sino en su potencial para esti-\nmular la reflexión, el análisis y la metacognición cuando son utilizadas como herramientas\nde apoyo y no como sustitutos del esfuerzo intelectual del estudiante [21].\nDesde la perspectiva institucional, la adopción de IA en universidades exige el desarrollo\nde competencias tecnopedagógicas en el profesorado, así como la definición de políticas\nclaras sobre su uso ético y responsable. Autores como García-Peñalvo et al. subrayan que\nmuchas de las problemáticas asociadas a la IA en ed", "start": 25500, "end": 26400}, {"chunk_id": "c35", "text": "políticas\nclaras sobre su uso ético y responsable. Autores como García-Peñalvo et al. subrayan que\nmuchas de las problemáticas asociadas a la IA en educación —como el plagio, los sesgos\nalgorítmicos o la brecha digital— ya existían antes, pero se ven amplificadas por la poten-\ncia de las tecnologías generativas, lo que obliga a replantear estrategias de evaluación y\nmodelos pedagógicos tradicionales [22].\nEn el ámbito universitario, la IA generativa también se ha explorado como asistente estra-\ntégico para el aprendizaje, apoyando tareas como la síntesis de información, la generación\nde ideas, la orientación académica y el acompañamiento en procesos de investigación.\nEstudios de casos en universidades latinoamericanas y europeas evidencian que, cuando\nestas herramientas se integran de forma planificada, contribuyen a mejorar la eficiencia del\naprendizaje y la percepción de utilidad por p", "start": 26250, "end": 27150}, {"chunk_id": "c36", "text": "que, cuando\nestas herramientas se integran de forma planificada, contribuyen a mejorar la eficiencia del\naprendizaje y la percepción de utilidad por parte de los estudiantes, sin sustituir el criterio\nacadémico humano [23].\n1.4.6 Interacción Humano–Computador (HCI)\nLa Interacción Humano–Computador (Human–Computer Interaction, HCI) es un campo\ninterdisciplinario que estudia la forma en que las personas interactúan con los sistemas\ncomputacionales, así como los principios y métodos necesarios para diseñar tecnologías\n9\nque resulten comprensibles, eficientes y acordes a las capacidades humanas. Su objetivo\ncentral no es únicamente optimizar el rendimiento técnico de los sistemas, sino asegurar\nque estos puedan ser entendidos y utilizados de manera significativa por los usuarios en\ncontextos reales de uso [24].\nDesde sus orígenes, la HCI ha integrado aportes de disciplinas como la informátic", "start": 27000, "end": 27900}, {"chunk_id": "c37", "text": "nera significativa por los usuarios en\ncontextos reales de uso [24].\nDesde sus orígenes, la HCI ha integrado aportes de disciplinas como la informática, la psi-\ncología cognitiva, la ergonomía, el diseño y las ciencias sociales. Esta naturaleza multidisci-\nplinaria permite analizar la interacción considerando tanto los aspectos tecnológicos como\nlos factores humanos, tales como la percepción, la memoria, la carga cognitiva y el contexto\nsociocultural en el que se produce la interacción. En este sentido, la HCI se orienta a reducir\nla brecha entre la lógica de funcionamiento de los sistemas y los modelos mentales de los\nusuarios [25].\nUn concepto clave dentro de la HCI es el de comunicabilidad, propuesto por la Ingeniería\nSemiótica, el cual plantea que la interfaz actúa como un medio de comunicación entre el\ndiseñador y el usuario. A través de la interfaz, el diseñador transmite sus inten", "start": 27750, "end": 28650}, {"chunk_id": "c38", "text": "plantea que la interfaz actúa como un medio de comunicación entre el\ndiseñador y el usuario. A través de la interfaz, el diseñador transmite sus intenciones, su-\npuestos y decisiones de diseño, mientras que el usuario interpreta estos mensajes durante\nla interacción. Cuando esta comunicación es clara y coherente, el usuario puede compren-\nder qué ofrece el sistema, cómo utilizarlo y cuáles son sus limitaciones; en caso contrario,\nse generan rupturas en la interacción y experiencias negativas de uso [26].\nLa HCI también se relaciona estrechamente con conceptos como usabilidad y experiencia\nde usuario. Mientras la usabilidad se enfoca en la eficacia, eficiencia y satisfacción con la\nque un usuario puede alcanzar sus objetivos, la HCI ofrece un marco más amplio para ana-\nlizar cómo se construye la interacción a lo largo del tiempo y cómo influyen los factores\ncognitivos, emocionales y conte", "start": 28500, "end": 29400}, {"chunk_id": "c39", "text": "n marco más amplio para ana-\nlizar cómo se construye la interacción a lo largo del tiempo y cómo influyen los factores\ncognitivos, emocionales y contextuales en dicha interacción. De esta manera, la HCI pro-\nporciona los fundamentos teóricos y metodológicos que sustentan el diseño centrado en el\nusuario [2].\nEn el ámbito educativo, la interacción humano–computador adquiere especial relevancia, ya\nque las plataformas digitales median gran parte de los procesos de enseñanza y aprendi-\nzaje. Un diseño deficiente de la interacción puede generar confusión, sobrecarga cognitiva\no desmotivación en los estudiantes. Por el contrario, una interacción bien diseñada facilita\nla comprensión de los contenidos, promueve la exploración autónoma y favorece un apren-\ndizaje más activo y significativo [27].\nEn el contexto de sistemas educativos apoyados por inteligencia artificial, la HCI permi-\n10\nte anal", "start": 29250, "end": 30150}, {"chunk_id": "c40", "text": "un apren-\ndizaje más activo y significativo [27].\nEn el contexto de sistemas educativos apoyados por inteligencia artificial, la HCI permi-\n10\nte analizar cómo los usuarios interpretan las recomendaciones, respuestas y adaptaciones\ngeneradas por el sistema. Una interacción transparente y comunicativa contribuye a generar\nconfianza en la tecnología y a evitar una dependencia acrítica de las respuestas automati-\nzadas. Por ello, la HCI se consolida como un eje fundamental para el diseño de soluciones\neducativas que integren IA de manera responsable y centrada en las personas.\n11\n2 METODOLOGÍA\nEste sección describe la forma en que se organizará y ejecutará el desarrollo del compo-\nnente, con el objetivo de que el proceso sea claro y pueda replicarse. La metodología se\nplantea como una guía para pasar desde la definición de necesidades y requerimientos has-\nta la construcción de prototipos,", "start": 30000, "end": 30900}, {"chunk_id": "c41", "text": "icarse. La metodología se\nplantea como una guía para pasar desde la definición de necesidades y requerimientos has-\nta la construcción de prototipos, la implementación de una interfaz funcional y su validación\ncon usuarios reales.\nDado que el componente implica decisiones de diseño que se refinan conforme se obtiene\nretroalimentación (por ejemplo, ajustes en navegación, presentación del contenido y flujo\nde interacción), se trabajará con un enfoque incremental. Por esta razón, el desarrollo se\nestructura en ciclos cortos que permiten planificar, ejecutar, revisar y mejorar entregables\nde manera progresiva, manteniendo control del avance y facilitando correcciones oportunas\nconforme se identifiquen nuevas necesidades.\nEn las siguientes secciones se detalla el marco de trabajo seleccionado (SCRUM), la or-\nganización del trabajo por sprints, las actividades realizadas en cada etapa, así com", "start": 30750, "end": 31650}, {"chunk_id": "c42", "text": "ones se detalla el marco de trabajo seleccionado (SCRUM), la or-\nganización del trabajo por sprints, las actividades realizadas en cada etapa, así como las\ntécnicas consideradas para recopilar información y evaluar los resultados del componente.\n2.1 Metodología SCRUM\nPara desarrollar el componente de Diseño de la Interfaz y Experiencia de Usuario (UX/UI)\nse empleó el marco de trabajo ágil SCRUM, ya que permite avanzar por iteraciones cor-\ntas, revisar resultados con frecuencia y ajustar el producto a medida que se obtiene nueva\nretroalimentación. En otras palabras, en lugar de intentar “acertar” a la primera, se trabaja\npor incrementos: se planifica, se construye, se revisa lo logrado y se mejora en el siguiente\nciclo. Este enfoque encaja bien con UX/UI porque el diseño se fortalece cuando se valida\ncon usuarios y se refina de forma continua [28].\nDe acuerdo con Scrum.org, SCRUM se organ", "start": 31500, "end": 32400}, {"chunk_id": "c43", "text": "ien con UX/UI porque el diseño se fortalece cuando se valida\ncon usuarios y se refina de forma continua [28].\nDe acuerdo con Scrum.org, SCRUM se organiza mediante un conjunto de roles, eventos\ny artefactos que buscan asegurar transparencia del trabajo, inspección frecuente del avan-\nce y adaptación oportuna ante cambios [28]. En este componente, dichos elementos se\naplicaron para ordenar la planificación semanal, mantener claridad sobre lo que se estaba\nconstruyendo y asegurar entregables verificables al final de cada sprint.\nA continuación, se presenta en la Figura 2.1 el framework general de SCRUM\n12\nFigura 2.1:Framework SCRUM (basado en Scrum.org) [28]\nEn las tablas siguientes, se presentan los elementos principales (equipo, eventos y artefac-\ntos) con su interpretación aplicada al componente UX/UI. Todas las definiciones y denomi-\nnaciones empleadas se basan en la descripción de Scru", "start": 32250, "end": 33150}, {"chunk_id": "c44", "text": "tefac-\ntos) con su interpretación aplicada al componente UX/UI. Todas las definiciones y denomi-\nnaciones empleadas se basan en la descripción de Scrum.org [28].\nTabla 2.1:Equipo SCRUM (basado en Scrum.org) [28]\nRol Responsabilidad principal Aplicación en el componente UX/UI\nProduct Owner Maximiza el valor del\nproducto y gestiona el\nProduct Backlog.\nPrioriza necesidades de la interfaz\n(funcionalidades, pantallas, flujos) y valida\nque el incremento responda al objetivo del\nsimulador.\nScrum Master Asegura que Scrum se\nentienda y se aplique; elimina\nimpedimentos.\nFacilita la dinámica de sprints, cuida que se\ncumplan eventos y ayuda a resolver\nbloqueos (dependencias técnicas, acceso a\nusuarios para pruebas, etc.).\nDevelopers Construyen el incremento y\nson responsables de convertir\nbacklog en resultados.\nDiseñan prototipos, implementan la UI y\nrealizan ajustes; documentan decisiones y\nprepara", "start": 33000, "end": 33900}, {"chunk_id": "c45", "text": "mento y\nson responsables de convertir\nbacklog en resultados.\nDiseñan prototipos, implementan la UI y\nrealizan ajustes; documentan decisiones y\npreparan el incremento para revisión y\npruebas.\n13\nTabla 2.2:Eventos SCRUM (basado en Scrum.org) [28]\nEvento Propósito Resultado esperado Cómo se aplicó al\ncomponente UX/UI\nSprint Iteración fija donde\nse construye un\nincremento.\nIncremento\npotencialmente\nutilizable.\nSprints semanales\npara entregar avances:\nprototipos, pantallas\nimplementadas,\nintegración y mejoras.\nSprint Planning Definir objetivo del\nsprint y seleccionar\ntrabajo del backlog.\nSprint Goal + Sprint\nBacklog.\nSelección de\nhistorias/tareas UX/UI\n(pantallas, flujos,\ncriterios de usabilidad)\ny definición del objetivo\nsemanal.\nDaily Scrum Inspección diaria del\navance y ajuste del\nplan.\nPlan actualizado para\nalcanzar el Sprint\nGoal.\nSeguimiento breve de\ntareas (por ejemplo:\nintegración con", "start": 33750, "end": 34650}, {"chunk_id": "c46", "text": "spección diaria del\navance y ajuste del\nplan.\nPlan actualizado para\nalcanzar el Sprint\nGoal.\nSeguimiento breve de\ntareas (por ejemplo:\nintegración con\nmódulos, cambios de\nflujo, ajustes de\naccesibilidad).\nSprint Review Revisión del\nincremento con\ninteresados y ajuste\ndel backlog.\nRetroalimentación y\nbacklog refinado.\nDemostración de la\ninterfaz o prototipo;\nregistro de mejoras de\nnavegación, claridad\nvisual y necesidades\ndetectadas.\nSprint Retrospective Mejorar el proceso\ndel equipo.\nAcciones de mejora\npara el siguiente\nsprint.\nLecciones aprendidas\n(tiempos,\ncomunicación, criterios\nde diseño) y ajustes en\nla forma de trabajo.\n14\nTabla 2.3:Artefactos SCRUM (basado en Scrum.org) [28]\nArtefacto Qué representa Contenido típico Uso en el componente\nUX/UI\nProduct Backlog Lista ordenada de\ntodo lo necesario\npara el producto.\nHistorias, requisitos,\nmejoras,\ncorrecciones.\nPantallas del simulador,", "start": 34500, "end": 35400}, {"chunk_id": "c47", "text": "nte\nUX/UI\nProduct Backlog Lista ordenada de\ntodo lo necesario\npara el producto.\nHistorias, requisitos,\nmejoras,\ncorrecciones.\nPantallas del simulador,\nflujos, criterios de\nusabilidad, componentes\nUI, ajustes por pruebas.\nSprint Backlog Trabajo seleccionado\npara el sprint + plan\npara completarlo.\nTareas del sprint. Wireframes, prototipos\nHi-Fi, implementación de\nvistas, integración con\nmódulos y correcciones\npriorizadas.\nIncremento Resultado integrado\ndel trabajo del sprint.\nFuncionalidad\nterminada y\nverificable.\nVersión de la interfaz lista\npara revisión y, cuando\naplique, para pruebas con\nestudiantes.\nTabla 2.4:Pilares de SCRUM aplicados al componente (basado en Scrum.org) [28]\nPrincipio Sentido en SCRUM Aplicación práctica en UX/UI\nTransparencia El trabajo y su estado deben ser\nvisibles para el equipo y partes\ninteresadas.\nBacklogs claros y entregables revisables\n(prototipos, pantallas", "start": 35250, "end": 36150}, {"chunk_id": "c48", "text": "arencia El trabajo y su estado deben ser\nvisibles para el equipo y partes\ninteresadas.\nBacklogs claros y entregables revisables\n(prototipos, pantallas, criterios de\ndiseño).\nInspección Revisión frecuente para detectar\ndesviaciones.\nRevisiones por sprint y pruebas de\nusabilidad para identificar fricción en la\ninterfaz.\nAdaptación Ajuste del plan cuando la\ninspección revela oportunidades o\nproblemas.\nIteraciones de diseño: cambios en\nnavegación, jerarquía visual y mensajes\nsegún evidencia.\n2.1.1 Definición y asignación de roles\nEl desarrollo del componente UX/UI se organizó bajo el marco de trabajo SCRUM, el cual\nestablece roles claramente definidos para asegurar una gestión ordenada del proyecto y una\n15\nadecuada coordinación de las actividades. La asignación de estos roles permitió estructurar\nel trabajo desde la planificación hasta la entrega del componente, garantizando coherencia\nentr", "start": 36000, "end": 36900}, {"chunk_id": "c49", "text": "des. La asignación de estos roles permitió estructurar\nel trabajo desde la planificación hasta la entrega del componente, garantizando coherencia\nentre los objetivos planteados y los resultados obtenidos [28].\nCada rol asumió responsabilidades específicas dentro del proceso, facilitando la toma de\ndecisiones, el seguimiento del avance y la generación de incrementos funcionales del com-\nponente. La Tabla 2.5 presenta los roles definidos y los responsables asignados para el\ndesarrollo del componente UX/UI.\nTabla 2.5:Roles y responsables del equipo SCRUM\nRol Responsable\nProduct Owner Larco Ampudia Enrique Andrés, PhD.\nScrum Master Larco Ampudia Enrique Andrés, PhD.\nEquipo de desarrollo Hernán Darío Sánchez Tenelanda\nCarlos Andrés Córdova Acaro\nMichael Andrés Pillaga Sosa\nCarla Annai Ruiz Acevedo\n2.1.2 Planificación y organización de los sprints\nLa planificación del desarrollo del componente", "start": 36750, "end": 37650}, {"chunk_id": "c50", "text": "Michael Andrés Pillaga Sosa\nCarla Annai Ruiz Acevedo\n2.1.2 Planificación y organización de los sprints\nLa planificación del desarrollo del componente UX/UI se realizó mediantesprints, entendi-\ndos como periodos de tiempo definidos en los que se ejecuta un conjunto de tareas orien-\ntadas a la obtención de un incremento del producto. Esta organización permitió dividir el\ntrabajo en etapas manejables y facilitar el control del avance del proyecto [28].\nCada sprint contó con tareas previamente definidas y una duración establecida, lo que per-\nmitió revisar los resultados obtenidos al final de cada ciclo y realizar ajustes oportunos en\nfunción de los avances y necesidades identificadas. La Tabla 2.6 presenta la planificación\nde los sprints definidos para el desarrollo del componente UX/UI.\n16\nTabla 2.6:Planificación de sprints del componente UX/UI\nSprint Tareas Duración\nSprint 0 Revisión del", "start": 37500, "end": 38400}, {"chunk_id": "c51", "text": "nidos para el desarrollo del componente UX/UI.\n16\nTabla 2.6:Planificación de sprints del componente UX/UI\nSprint Tareas Duración\nSprint 0 Revisión del documento TIC y definición de objetivos de diseño\nUX/UI.\n20 horas\nSprint 1 Análisis de herramientas de IA generativa y levantamiento de\nrequerimientos.\n20 horas\nSprint 2 Diseño de prototipos de baja fidelidad y estructura de\nnavegación.\n20 horas\nSprint 3 Desarrollo de prototipos de alta fidelidad y ajustes iniciales. 20 horas\nSprint 4 Implementación inicial de la interfaz web. 20 horas\nSprint 5 Integración de módulos funcionales del simulador. 20 horas\nSprint 6 Pruebas de usabilidad con estudiantes y mejoras iterativas. 20 horas\nSprint 7 Documentación técnica del componente y entrega final. 20 horas\n2.2 Tecnologías Utilizadas\nEl desarrollo del componente de Diseño de la Interfaz y Experiencia de Usuario (UX/UI) del\nsimulador educativo se a", "start": 38250, "end": 39150}, {"chunk_id": "c52", "text": "0 horas\n2.2 Tecnologías Utilizadas\nEl desarrollo del componente de Diseño de la Interfaz y Experiencia de Usuario (UX/UI) del\nsimulador educativo se apoyó en tecnologías web ampliamente utilizadas en el desarrollo\nde interfaces interactivas. Estas tecnologías fueron seleccionadas por su estabilidad, docu-\nmentación disponible y compatibilidad con arquitecturas modernas basadas en servicios.\nEn esta sección se presentan los lenguajes, frameworks, plataformas y herramientas em-\npleadas, incluyendo una breve descripción de su función dentro del desarrollo del compo-\nnente. La información se organiza en tablas con el fin de facilitar su comprensión y replica-\nbilidad.\n17\nTabla 2.7:Lenguajes y frameworks utilizados\nTecnología Tipo Descripción\nHTML5 Lenguaje de marcado Lenguaje estándar para estructurar el contenido de\naplicaciones web [29].\nCSS3 Lenguaje de estilos Lenguaje utilizado para def", "start": 39000, "end": 39900}, {"chunk_id": "c53", "text": "ML5 Lenguaje de marcado Lenguaje estándar para estructurar el contenido de\naplicaciones web [29].\nCSS3 Lenguaje de estilos Lenguaje utilizado para definir la presentación visual\ny el diseño responsivo de interfaces web [30].\nJavaScript Lenguaje de programación Lenguaje de programación orientado a la interacción\ny lógica del lado del cliente [31].\nReact Biblioteca / framework Biblioteca de JavaScript para la construcción de\ninterfaces basadas en componentes reutilizables\n[32].\nTabla 2.8:Plataformas y APIs consideradas\nPlataforma Tipo Descripción\nAPIs REST Interfaz de programación Estilo de arquitectura que permite la comunicación\nentre sistemas mediante servicios web [17].\nNode.js Plataforma de ejecución Entorno de ejecución que permite ejecutar JavaScript\ndel lado del servidor [33].\n2.2.1 Herramientas Utilizadas\nPara apoyar las actividades de diseño y desarrollo del componente UX/UI se u", "start": 39750, "end": 40650}, {"chunk_id": "c54", "text": "utar JavaScript\ndel lado del servidor [33].\n2.2.1 Herramientas Utilizadas\nPara apoyar las actividades de diseño y desarrollo del componente UX/UI se utilizaron he-\nrramientas que facilitaron el trabajo colaborativo, la implementación del código y la gestión\ndel proyecto.\nTabla 2.9:Herramientas utilizadas durante el desarrollo\nHerramienta Tipo Descripción\nFigma Diseño y prototipado Herramienta colaborativa para el diseño de\ninterfaces y prototipos interactivos [34].\nVisual Studio Code Editor de código Editor de código fuente multiplataforma\nampliamente utilizado en desarrollo web [35].\nNPM Gestor de paquetes Administrador de dependencias para proyectos\nbasados en JavaScript [36].\nGit Control de versiones Sistema de control de versiones distribuido para el\nseguimiento de cambios en el código [37].\n18\n2.3 Etapa de Desarrollo\n2.3.1 Sprint 0: Análisis inicial y definición del enfoque UX/UI\nEl", "start": 40500, "end": 41400}, {"chunk_id": "c55", "text": "ibuido para el\nseguimiento de cambios en el código [37].\n18\n2.3 Etapa de Desarrollo\n2.3.1 Sprint 0: Análisis inicial y definición del enfoque UX/UI\nEl Sprint 0 se planteó como una etapa estratégica previa al desarrollo del componente\nUX/UI, orientada a reducir la incertidumbre inicial y establecer criterios claros antes de ini-\nciar actividades de diseño o implementación. Aunque el proyecto contaba con objetivos\ngenerales definidos en el documento TIC, fue necesario analizar estos lineamientos desde\nuna perspectiva de experiencia de usuario, con el fin de traducirlos en decisiones concretas\nde diseño y alcance funcional. Este enfoque permitió identificar tempranamente qué aspec-\ntos del simulador requerían mayor énfasis en la interacción y cómo la interfaz podía apoyar\nde forma efectiva el proceso de aprendizaje del usuario.\nDurante este sprint se realizó un análisis crítico del document", "start": 41250, "end": 42150}, {"chunk_id": "c56", "text": "cómo la interfaz podía apoyar\nde forma efectiva el proceso de aprendizaje del usuario.\nDurante este sprint se realizó un análisis crítico del documento TIC general, evaluando\nla coherencia entre los objetivos específicos del componente y las funcionalidades espe-\nradas del simulador. A partir de este análisis se definió el enfoque UX/UI, delimitando el\nalcance del componente y estableciendo prioridades iniciales. Esta actividad permitió evi-\ntar supuestos implícitos sobre la interfaz y generar una comprensión compartida de lo que\ndebía resolverse desde el diseño, especialmente en términos de navegación, organización\ndel contenido y presentación de la información generada por la inteligencia artificial.\nComo resultado del Sprint 0, se formularon objetivos de diseño UX/UI alineados con las\nnecesidades del usuario finalestudiantes universitariosy con el contexto académico del\nproyecto. Asim", "start": 42000, "end": 42900}, {"chunk_id": "c57", "text": "aron objetivos de diseño UX/UI alineados con las\nnecesidades del usuario finalestudiantes universitariosy con el contexto académico del\nproyecto. Asimismo, se establecieron criterios iniciales de usabilidad relacionados con la\nclaridad de los flujos, la consistencia visual y la retroalimentación durante la interacción.\nEstos criterios funcionaron como marco de referencia para evaluar las decisiones tomadas\nen los sprints posteriores.\n2.3.2 Sprint 1: Análisis de herramientas de IA generativa y levanta-\nmiento de requerimientos\n2.3.2.1 Análisis de herramientas de IA generativa en contextos educa-\ntivos\nEn el marco del Sprint 1 se realizó un análisis conceptual de distintas herramientas y en-\nfoques de inteligencia artificial generativa descritos en la literatura académica, con el obje-\ntivo de identificar criterios relevantes para el diseño de la interfaz del simulador educativo.\n19\nEste a", "start": 42750, "end": 43650}, {"chunk_id": "c58", "text": "tos en la literatura académica, con el obje-\ntivo de identificar criterios relevantes para el diseño de la interfaz del simulador educativo.\n19\nEste análisis no se enfocó en aspectos técnicos de implementación, sino en la forma en\nque dichas herramientas presentan información, estructuran los resultados y acompañan\nal usuario durante el proceso de aprendizaje, elementos clave desde la perspectiva de la\nexperiencia de usuario.\nDiversos autores coinciden en que la inteligencia artificial generativa se caracteriza por su\ncapacidad para producir contenidos nuevos como textos, explicaciones o ejemplos a partir\nde patrones aprendidos de grandes volúmenes de datos [8], [9]. En contextos educativos,\nesta capacidad ha sido utilizada principalmente como apoyo al aprendizaje autónomo, la\ngeneración de explicaciones personalizadas y la simulación de escenarios de práctica, es-\npecialmente en educaci", "start": 43500, "end": 44400}, {"chunk_id": "c59", "text": "omo apoyo al aprendizaje autónomo, la\ngeneración de explicaciones personalizadas y la simulación de escenarios de práctica, es-\npecialmente en educación superior [12], [19]. Sin embargo, la literatura enfatiza que el valor\neducativo de estas herramientas no depende únicamente de la calidad del contenido gene-\nrado, sino de cómo este es presentado y contextualizado para el estudiante.\nEstudios recientes señalan que muchas herramientas de IA generativa orientadas a la edu-\ncación destacan por integrar interfaces que priorizan la claridad visual, la segmentación de\nla información y la retroalimentación inmediata [10], [13]. Estas características permiten que\nel usuario comprenda no solo el resultado generado, sino también el razonamiento asocia-\ndo, lo cual resulta fundamental para fomentar el pensamiento crítico y evitar una interacción\npasiva con la tecnología. En este sentido, la explica", "start": 44250, "end": 45150}, {"chunk_id": "c60", "text": "a-\ndo, lo cual resulta fundamental para fomentar el pensamiento crítico y evitar una interacción\npasiva con la tecnología. En este sentido, la explicabilidad y la transparencia de los resulta-\ndos se convierten en factores determinantes para su aceptación y uso efectivo en entornos\nuniversitarios.\nDesde la perspectiva del diseño centrado en el usuario, la literatura sobre experiencia de\nusuario resalta que los sistemas basados en inteligencia artificial deben minimizar la carga\ncognitiva y facilitar la interpretación de la información presentada [1], [2]. Esto implica inter-\nfaces que organicen los resultados de manera jerárquica, utilicen un lenguaje comprensible\ny ofrezcan apoyos visuales o textuales que guíen al estudiante en la lectura y análisis de los\ncontenidos generados. Estas recomendaciones coinciden con los principios establecidos\npor la norma ISO 9241-210, que subraya la impo", "start": 45000, "end": 45900}, {"chunk_id": "c61", "text": "y análisis de los\ncontenidos generados. Estas recomendaciones coinciden con los principios establecidos\npor la norma ISO 9241-210, que subraya la importancia de adaptar los sistemas interacti-\nvos a las capacidades y necesidades del usuario final.\nA partir de este análisis, se identificó que las herramientas de IA generativa utilizadas en\neducación comparten patrones comunes que pueden servir como referencia para el dise-\nño del componente UX/UI del simulador. Entre estos patrones se destacan la presentación\nprogresiva de la información, la disponibilidad de explicaciones complementarias, la retro-\nalimentación clara ante las acciones del usuario y la consistencia visual a lo largo de la\ninteracción. Estos elementos no implican la adopción directa de herramientas existentes,\n20\nsino que funcionan como insumos conceptuales para definir cómo los resultados genera-\ndos por otros componentes", "start": 45750, "end": 46650}, {"chunk_id": "c62", "text": "directa de herramientas existentes,\n20\nsino que funcionan como insumos conceptuales para definir cómo los resultados genera-\ndos por otros componentes del sistema deben ser mostrados e interpretados dentro de la\ninterfaz.\nEn consecuencia, el análisis de herramientas de IA generativa permitió establecer una base\nconceptual sólida para el levantamiento de requerimientos del componente UX/UI, asegu-\nrando que el diseño de la interfaz esté alineado tanto con las buenas prácticas identificadas\nen la literatura como con las necesidades específicas del contexto educativo universitario\n[21], [22].\n2.3.2.2 Requerimientos funcionales\nA partir del análisis de herramientas de inteligencia artificial generativa y de su aplicación\nen contextos educativos universitarios, se identificaron los requerimientos funcionales del\ncomponente UX/UI del simulador. Estos requerimientos describen las funcionalidade", "start": 46500, "end": 47400}, {"chunk_id": "c63", "text": "universitarios, se identificaron los requerimientos funcionales del\ncomponente UX/UI del simulador. Estos requerimientos describen las funcionalidades que\nla interfaz debe ofrecer para permitir una interacción efectiva entre el estudiante y los con-\ntenidos generados por el sistema, garantizando claridad, comprensión y apoyo al proceso\nde aprendizaje.\nA continuación, en la Tabla 2.10, se presentan los requerimientos funcionales definidos para\neste componente.\n21\nTabla 2.10:Requerimientos funcionales del componente UX/UI\nID Descripción del requisito\nRF-01 El sistema debe permitir la visualización de los resultados generados por el simulador\nde forma clara y estructurada.\nRF-02 El sistema debe mostrar explicaciones asociadas a los resultados presentados para\nfacilitar su comprensión.\nRF-03 El sistema debe permitir la presentación de ejemplos complementarios que refuercen\nlos conceptos eva", "start": 47250, "end": 48150}, {"chunk_id": "c64", "text": "presentados para\nfacilitar su comprensión.\nRF-03 El sistema debe permitir la presentación de ejemplos complementarios que refuercen\nlos conceptos evaluados.\nRF-04 El sistema debe permitir la navegación fluida entre los distintos módulos del simulador\nsin pérdida de contexto.\nRF-05 El sistema debe proporcionar retroalimentación visual inmediata ante las acciones\nrealizadas por el usuario.\nRF-06 El sistema debe permitir la organización progresiva de la información cuando los\nresultados sean extensos.\nRF-07 El sistema debe mostrar mensajes claros y orientativos cuando se detecten errores o\nacciones incorrectas del usuario.\nRF-08 El sistema debe permitir al usuario identificar claramente las secciones y estados de la\ninterfaz durante la interacción.\n2.3.2.3 Requerimientos no funcionales\nAdemás de las funcionalidades que debe ofrecer la interfaz, es necesario definir un con-\njunto de requeri", "start": 48000, "end": 48900}, {"chunk_id": "c65", "text": "cción.\n2.3.2.3 Requerimientos no funcionales\nAdemás de las funcionalidades que debe ofrecer la interfaz, es necesario definir un con-\njunto de requerimientos no funcionales que establezcan las condiciones de calidad bajo las\ncuales el componente UX/UI debe operar. Estos requerimientos no describen acciones es-\npecíficas del sistema, sino atributos relacionados con la usabilidad, claridad, consistencia y\naccesibilidad de la interfaz, los cuales son fundamentales para garantizar una experiencia\nde usuario adecuada en contextos educativos universitarios.\nA continuación, en la Tabla 2.11, se presentan los requerimientos no funcionales definidos\npara este componente.\n22\nTabla 2.11:Requerimientos no funcionales del componente UX/UI\nID Descripción del requisito\nRNF-01 La interfaz debe presentar la información con una jerarquía visual clara que facilite su\ncomprensión.\nRNF-02 El diseño visual de", "start": 48750, "end": 49650}, {"chunk_id": "c66", "text": "del requisito\nRNF-01 La interfaz debe presentar la información con una jerarquía visual clara que facilite su\ncomprensión.\nRNF-02 El diseño visual de la interfaz debe ser consistente en todas las pantallas del\nsimulador.\nRNF-03 La interfaz debe minimizar la carga cognitiva del usuario mediante una presentación\nordenada de la información.\nRNF-04 Los textos y mensajes mostrados en la interfaz deben utilizar un lenguaje claro y\ncomprensible para estudiantes universitarios.\nRNF-05 La interfaz debe ofrecer retroalimentación comprensible y oportuna ante las acciones\nrealizadas por el usuario.\nRNF-06 La interfaz debe permitir una navegación intuitiva, reduciendo la necesidad de\naprendizaje previo.\nRNF-07 La interfaz debe ser accesible para usuarios con distintos niveles de experiencia\ntecnológica.\nRNF-08 La interfaz debe mantener coherencia visual y funcional al presentar los resultados\ngenera", "start": 49500, "end": 50400}, {"chunk_id": "c67", "text": "os con distintos niveles de experiencia\ntecnológica.\nRNF-08 La interfaz debe mantener coherencia visual y funcional al presentar los resultados\ngenerados por el simulador.\n2.3.2.4 Historias de usuario\nCon base en los requerimientos funcionales y no funcionales definidos previamente, se\nelaboraron las historias de usuario del componente UX/UI del simulador. Las historias de\nusuario permiten describir las necesidades del sistema desde la perspectiva del usuario\nfinal, facilitando la planificación del desarrollo y asegurando la trazabilidad entre los objetivos\ndel diseño y las funcionalidades a implementar.\nPara mantener uniformidad en su redacción y evaluación, se adoptó el formato que se\npresenta a continuación en la Tabla 2.12.\nTabla 2.12:Formato de historias de usuario\nCódigo Título Descripción Criterio de\naceptación\nPrioridad\nHU-XX Nombre\ndescriptivo\nComo [usuario], quiero\n[objetivo] p", "start": 50250, "end": 51150}, {"chunk_id": "c68", "text": "ormato de historias de usuario\nCódigo Título Descripción Criterio de\naceptación\nPrioridad\nHU-XX Nombre\ndescriptivo\nComo [usuario], quiero\n[objetivo] para [beneficio].\nDado...,\ncuando...,\nentonces...\nAlta / Media /\nBaja\n23\nA partir de este formato, se definieron las historias de usuario del componente UX/UI, las\ncuales se presentan a continuación en la Tabla 2.13.\nEstas historias reflejan los principales escenarios de interacción del estudiante con la inter-\nfaz y sirven como base para la planificación de los sprints posteriores, en coherencia con la\nmetodología SCRUM.\nTabla 2.13:Historias de usuario del componente UX/UI\nCódigo Título Descripción Criterio de aceptación Prioridad\nHU-01 Visualización de\nresultados\nComo estudiante, quiero\nvisualizar los resultados del\nsimulador de forma clara para\ncomprender mi desempeño.\nDado que completo una actividad,\ncuando accedo a los resultados,\nenton", "start": 51000, "end": 51900}, {"chunk_id": "c69", "text": "lizar los resultados del\nsimulador de forma clara para\ncomprender mi desempeño.\nDado que completo una actividad,\ncuando accedo a los resultados,\nentonces estos se muestran de\nforma estructurada.\nAlta\nHU-02 Consulta de\nexplicaciones\nComo estudiante, quiero\nacceder a explicaciones\nasociadas a los resultados para\nentenderlos mejor.\nDado que visualizo un resultado,\ncuando solicito una explicación,\nentonces el sistema la presenta\nde forma clara.\nAlta\nHU-03 Acceso a ejemplos Como estudiante, quiero ver\nejemplos complementarios para\nreforzar mi comprensión.\nDado que reviso una explicación,\ncuando solicito ejemplos,\nentonces se muestran casos\nilustrativos.\nMedia\nHU-04 Navegación entre\nmódulos\nComo estudiante, quiero\nnavegar entre módulos sin\nperder el contexto de\naprendizaje.\nDado que cambio de módulo,\ncuando navego por la interfaz,\nentonces mantengo el contexto\nprevio.\nAlta\nHU-05 Retroalimentac", "start": 51750, "end": 52650}, {"chunk_id": "c70", "text": "el contexto de\naprendizaje.\nDado que cambio de módulo,\ncuando navego por la interfaz,\nentonces mantengo el contexto\nprevio.\nAlta\nHU-05 Retroalimentación\nvisual\nComo estudiante, quiero recibir\nretroalimentación visual sobre\nmis acciones para saber si\nfueron correctas.\nDado que realizo una acción,\ncuando el sistema la procesa,\nentonces recibo una respuesta\nvisual comprensible.\nMedia\nHU-06 Organización\nprogresiva\nComo estudiante, quiero que la\ninformación extensa se muestre\nde forma progresiva para no\nsaturarme.\nDado que reviso resultados\nextensos, cuando avanzo en la\nlectura, entonces la información\nse presenta por secciones.\nMedia\nHU-07 Identificación de\nsecciones\nComo estudiante, quiero\nidentificar fácilmente las\nsecciones de la interfaz para\norientarme mejor.\nDado que ingreso a una pantalla,\ncuando observo la interfaz,\nentonces reconozco claramente\nsus secciones.\nAlta\nHU-08 Mensajes de", "start": 52500, "end": 53400}, {"chunk_id": "c71", "text": "ara\norientarme mejor.\nDado que ingreso a una pantalla,\ncuando observo la interfaz,\nentonces reconozco claramente\nsus secciones.\nAlta\nHU-08 Mensajes de error Como estudiante, quiero recibir\nmensajes claros cuando cometo\nerrores para saber cómo\ncorregirlos.\nDado que ocurre un error, cuando\nel sistema lo detecta, entonces\nmuestra un mensaje orientativo.\nMedia\nHU-09 Consistencia visual Como estudiante, quiero que la\ninterfaz mantenga coherencia\nvisual en todas las pantallas.\nDado que navego entre pantallas,\ncuando cambio de vista, entonces\nse mantiene el mismo estilo\nvisual.\nMedia\nHU-10 Comprensión del\nflujo\nComo estudiante, quiero\nentender el flujo general del\nsimulador desde el primer uso.\nDado que utilizo el sistema por\nprimera vez, cuando completo\nuna tarea, entonces comprendo el\nflujo general.\nAlta\nHU-11 Claridad del lenguaje Como estudiante, quiero que los\ntextos sean claros para\ninter", "start": 53250, "end": 54150}, {"chunk_id": "c72", "text": "ompleto\nuna tarea, entonces comprendo el\nflujo general.\nAlta\nHU-11 Claridad del lenguaje Como estudiante, quiero que los\ntextos sean claros para\ninterpretar correctamente la\ninformación.\nDado que leo un mensaje, cuando\neste se presenta, entonces utiliza\nun lenguaje comprensible.\nMedia\nHU-12 Facilidad de uso Como estudiante, quiero que la\ninterfaz sea fácil de usar sin\nnecesidad de capacitación\nprevia.\nDado que interactúo con la\ninterfaz, cuando realizo acciones\nbásicas, entonces puedo hacerlo\nsin dificultad.\nAlta\n24\n2.3.3 Sprint 2: Diseño de prototipos de baja fidelidad y estructura de\nnavegación\nEl Sprint 2 se enfocó en el diseño de prototipos de baja fidelidad y en la definición deta-\nllada de la estructura de navegación del Simulador de Clases Personalizadas con IA. Esta\netapa resulta fundamental dentro del proceso de desarrollo, ya que permite transformar los\nrequerimientos identific", "start": 54000, "end": 54900}, {"chunk_id": "c73", "text": "Clases Personalizadas con IA. Esta\netapa resulta fundamental dentro del proceso de desarrollo, ya que permite transformar los\nrequerimientos identificados en el Sprint 1 en un flujo de interacción concreto, comprensible\ny validable desde el punto de vista del usuario, antes de abordar decisiones visuales o de\nimplementación más complejas.\nLa necesidad de describir y modelar el flujo de navegación en esta fase responde a que\nla interacción con sistemas educativos basados en inteligencia artificial puede generar in-\ncertidumbre en los usuarios si el proceso no es claro desde el inicio. En particular, cuando\nel sistema realiza procesos internos que no son visibles como la generación de conteni-\ndos personalizados, la interfaz se convierte en el principal medio para comunicar al usuario\nqué está ocurriendo, en qué etapa se encuentra y qué se espera de él en cada momento.\nPor ello, definir ex", "start": 54750, "end": 55650}, {"chunk_id": "c74", "text": "l principal medio para comunicar al usuario\nqué está ocurriendo, en qué etapa se encuentra y qué se espera de él en cada momento.\nPor ello, definir explícitamente el recorrido entre pantallas no solo facilita el uso del siste-\nma, sino que contribuye a generar confianza y comprensión del funcionamiento general del\nsimulador.\nDesde una perspectiva centrada en el estudiante, el diseño del flujo de navegación se plan-\nteó como un acompañamiento progresivo a lo largo del proceso de simulación. En lugar de\npresentar múltiples opciones de forma simultánea, se optó por una secuencia controlada de\npantallas que guía al usuario paso a paso, reduciendo la carga cognitiva y evitando decisio-\nnes innecesarias. Esta estrategia resulta especialmente relevante en contextos educativos,\ndonde el objetivo principal no es la exploración libre del sistema, sino el apoyo efectivo al\nproceso de aprendizaje.\nP", "start": 55500, "end": 56400}, {"chunk_id": "c75", "text": "vante en contextos educativos,\ndonde el objetivo principal no es la exploración libre del sistema, sino el apoyo efectivo al\nproceso de aprendizaje.\nPara materializar este análisis, los prototipos de baja fidelidad fueron desarrollados utili-\nzando la herramienta Figma, la cual permitió representar de forma visual y estructurada la\ndisposición de los elementos,\nPantalla de inicio de sesión:\nLa pantalla de inicio de sesión constituye el primer punto de interacción del usuario con el\nsimulador y cumple un rol clave en la contextualización del uso académico de la plataforma.\nSu objetivo principal es permitir el acceso al sistema mediante credenciales institucionales\n25\nsimuladas, estableciendo desde el inicio un marco de uso orientado al ámbito universitario.\nDesde el punto de vista del diseño, esta pantalla fue concebida para ser clara y directa,\npriorizando la comprensión inmediata de su", "start": 56250, "end": 57150}, {"chunk_id": "c76", "text": "o universitario.\nDesde el punto de vista del diseño, esta pantalla fue concebida para ser clara y directa,\npriorizando la comprensión inmediata de su función. Se limitaron los elementos visuales a\nlos estrictamente necesarios, como los campos de ingreso y el botón de acceso, con el fin\nde evitar distracciones y reducir la carga cognitiva en esta etapa inicial. Esta decisión busca\nque el usuario complete el acceso al sistema de forma rápida y sin ambigüedades.\nAsimismo, la pantalla de inicio de sesión permite identificar el rol del usuario dentro del\nsimulador, lo cual resulta relevante para contextualizar el recorrido posterior. Aunque el\nenfoque principal del componente es el estudiante, esta identificación inicial refuerza la\ncoherencia del flujo de navegación y prepara al sistema para adaptar la experiencia de\nacuerdo con el perfil definido.\nEn la Figura 2.2, se presenta el prototipo", "start": 57000, "end": 57900}, {"chunk_id": "c77", "text": "el flujo de navegación y prepara al sistema para adaptar la experiencia de\nacuerdo con el perfil definido.\nEn la Figura 2.2, se presenta el prototipo de baja fidelidad de la pantalla de inicio de sesión,\ndesarrollado en Figma. Esta representación permitió validar la disposición de los campos,\nla jerarquía visual de los elementos y la claridad del mensaje transmitido al usuario, antes\nde avanzar hacia prototipos de mayor fidelidad.\nFigura 2.2:Pantalla de inicio de sesión del simulador\n26\n3 RESULTADOS, CONCLUSIONES Y RECOMENDACIONES\n3.1 Resultados\nExponer los resultados obtenidos, utilizando para esto el apoyo de tablas, figuras, entre\notros.\nUn ejemplo de una tabla se presenta en Tabla 3.1.\nTabla 3.1:Ejemplo tabla y alineación de texto.\nTexto Centrado Texto Centrado Texto Centrado\nLos comandos en esta celda\ntambién permiten centrar el texto.\nEste texto aparece justifi-\ncado.\nEste texto ap", "start": 57750, "end": 58650}, {"chunk_id": "c78", "text": "o Centrado Texto Centrado Texto Centrado\nLos comandos en esta celda\ntambién permiten centrar el texto.\nEste texto aparece justifi-\ncado.\nEste texto aparece\ncentrado.\nTexto centrado para 3 filas\n1 0,00\n2 0,00\n3 0,00\nTexto centrado para 3 columnas\nEjemplo de nota para una tabla [1]\nEjemplo Imagen\nPRUEBA\nUn ejemplo de una figura se presenta en Figura 3.1\nFigura 3.1:Ejemplo imagen\n27\n3.2 Conclusiones\nPresenta lo novedoso del trabajo de integración curricular, así como evaluación del cumpli-\nmiento o no de lo propuesto en los objetivos. En el caso en que no se cumpla uno o varios\nobjetivos, y no se logren los resultados esperados, se propone una posible respuesta que\nexplique por qué sucedió esto o las falencias de la planteado.\n3.3 Recomendaciones\nIndicar las recomendaciones formuladas a partir del desarrollo de este trabajo de integración\ncurricular.\n28\n4 REFERENCIAS BIBLIOGRÁFICAS\n[1] Y .", "start": 58500, "end": 59400}, {"chunk_id": "c79", "text": "nes\nIndicar las recomendaciones formuladas a partir del desarrollo de este trabajo de integración\ncurricular.\n28\n4 REFERENCIAS BIBLIOGRÁFICAS\n[1] Y . Hassan Montero,Experiencia de Usuario: Principios y Métodos. 2015.\n[2]ISO 9241-210:2019 Ergonomics of Human-System Interaction – Human-centred de-\nsign for interactive systems, International Organization for Standardization, 2019.\n[3] P . B. Vidal y A. Martin, «Experiencia de Usuario y Diseño Web Responsivo: Un enfo-\nque integrado,»Revista ICT -UNPA, vol. 12, n.o 1, 2019.\n[4] L. S. M. Gómez,Diseño de Interfaces de Usuario: Principios, Prototipos y Heurísticas\npara Evaluación. 2012.\n[5] M. C. Albornoz, «Diseño de Interfaz Gráfica de Usuario,» enWICC, 2014.\n[6] S. Morejón Labrada, «Principios del proceso de Diseño de Interfaz de Usuario,»Re-\nvista Cubana de Transformación Digital, vol. 1, n.o 3, 2020.\n[7] M. C. Albornoz, M. Berón y G. Monteja", "start": 59250, "end": 60150}, {"chunk_id": "c80", "text": "l proceso de Diseño de Interfaz de Usuario,»Re-\nvista Cubana de Transformación Digital, vol. 1, n.o 3, 2020.\n[7] M. C. Albornoz, M. Berón y G. Montejano, «Interfaz Gráfica de Usuario: el usuario\ncomo protagonista del diseño,» Universidad Nacional de San Luis, inf. téc., 2000.\n[8] J. R. Casar Corredera, «Inteligencia artificial generativa,»Anales de la Real Academia\nde Doctores de España, vol. 8, n.o 3, págs. 475-489, 2023.\n[9] K. M. Gutiérrez López, «Inteligencia artificial generativa: irrupción y desafíos,»Revista\nEnfoques, 2023.\n[10] L. Finkel et al., «ChatGPT como fuente de información en la Educación Superior,»\nProfesional de la información, vol. 33, n.o 6, 2024.\n[11] J. Franganillo, «La inteligencia artificial generativa y su impacto en la creación de\ncontenidos mediáticos,»methaodos.revista de ciencias sociales, vol. 11, n. o 2, 2023.\n[12] J. C. Sánchez-Prieto et al., «Inteligencia", "start": 60000, "end": 60900}, {"chunk_id": "c81", "text": "n la creación de\ncontenidos mediáticos,»methaodos.revista de ciencias sociales, vol. 11, n. o 2, 2023.\n[12] J. C. Sánchez-Prieto et al., «Inteligencia artificial generativa para autoaprendizaje en\neducación superior,»RIED, vol. 28, n. o 1, págs. 59-81, 2025.\n[13] L. Finkel et al., «Valoración crítica de la IA generativa en contextos educativos,»Pro-\nfesional de la información, 2024.\n[14] B. Cooksey,An Introduction to APIs. Zapier Inc., 2014.\n[15] D. Jacobson, G. Brail y D. Woods,APIs: A Strategy Guide. O’Reilly Media, 2012.\n[16] E. Amodeo,Principios de diseño de APIs REST. Leanpub, 2013.\n[17] R. T. Fielding, «Architectural Styles and the Design of Network-based Software Archi-\ntectures,» Tesis doct., University of California, Irvine, 2000.\n29\n[18] D. Jacobson, G. Brail y D. Woods, «The API Opportunity,» enAPIs: A Strategy Guide,\nO’Reilly Media, 2012.\n[19] F . J. García-Peñalvo, F . Llore", "start": 60750, "end": 61650}, {"chunk_id": "c82", "text": "29\n[18] D. Jacobson, G. Brail y D. Woods, «The API Opportunity,» enAPIs: A Strategy Guide,\nO’Reilly Media, 2012.\n[19] F . J. García-Peñalvo, F . Llorens-Largo y J. Vidal, «La nueva realidad de la educación\nante los avances de la inteligencia artificial generativa,»RIED-Revista Iberoamericana\nde Educación a Distancia, vol. 27, n.o 1, 2024.\n[20] A. Cortés Hernández et al., «La inteligencia artificial generativa como un asistente\nestratégico en la era del aprendizaje digital,»Ciencia Latina Revista Científica Multi-\ndisciplinar, vol. 8, n.o 4, 2024.\n[21] C. Muñoz Martínez, V. Roger-Monzo y F . Castelló-Sirvent, «IA generativa y pensa-\nmiento crítico en la educación universitaria,»RIED-Revista Iberoamericana de Edu-\ncación a Distancia, vol. 28, n.o 2, 2025.\n[22] F . J. García-Peñalvo et al., «Artificial intelligence in education: challenges and oppor-\ntunities,»RIED, 2024.\n[23] M. Zapata Ros", "start": 61500, "end": 62400}, {"chunk_id": "c83", "text": "n.o 2, 2025.\n[22] F . J. García-Peñalvo et al., «Artificial intelligence in education: challenges and oppor-\ntunities,»RIED, 2024.\n[23] M. Zapata Ros, «IA generativa y ChatGPT en educación: un reto para la evaluación\ny una nueva pedagogía,»Revista Paraguaya de Educación a Distancia, vol. 5, n. o 1,\n2024.\n[24] G. M. Martínez de la Teja, «Ergonomía e interfases de interacción humano-\ncomputadora,» enIX Congreso Internacional de Ergonomía, México, 2007.\n[25] Y . Rogers, «New theoretical approaches for HCI,»Annual Review of Information\nScience and Technology, vol. 38, 2004.\n[26] L. Correa Alfaro, «Comunicabilidad, paradigma de la Interacción Humano-\nComputador,»No Solo Usabilidad, n. o 9, 2010,ISSN: 1886-8592.\n[27] A. K. Alcívar-Cedeño et al., «Interacción humano-computador en el metaverso edu-\ncativo,»Revista PENTACIENCIAS, vol. 5, n.o 2, 2023.\n[28] Scrum.org. «What is Scrum?» Visitado 14", "start": 62250, "end": 63150}, {"chunk_id": "c84", "text": "«Interacción humano-computador en el metaverso edu-\ncativo,»Revista PENTACIENCIAS, vol. 5, n.o 2, 2023.\n[28] Scrum.org. «What is Scrum?» Visitado 14 de dic. de 2025. dirección: https://www.\nscrum.org/learning-series/what-is-scrum\n[29] W3C. «HTML5 Specification,» visitado 14 de dic. de 2025. dirección: https://www.w3.\norg/TR/html52/\n[30] W3C. «CSS Snapshot,» visitado 14 de dic. de 2025. dirección: https://www.w3.org/\nTR/CSS/\n30\n[31] Mozilla Developer Network. «JavaScript Guide,» visitado 14 de dic. de 2025. direc-\nción: https://developer.mozilla.org/en-US/docs/Web/JavaScript\n[32] Meta Platforms Inc. «React Documentation,» visitado 14 de dic. de 2025. dirección:\nhttps://react.dev/\n[33] OpenJS Foundation. «Node.js Documentation,» visitado 14 de dic. de 2025. dirección:\nhttps://nodejs.org/en/docs/\n[34] Figma Inc. «Figma Help Center,» visitado 14 de dic. de 2025. dirección: https://help.\nfig", "start": 63000, "end": 63900}, {"chunk_id": "c85", "text": "de dic. de 2025. dirección:\nhttps://nodejs.org/en/docs/\n[34] Figma Inc. «Figma Help Center,» visitado 14 de dic. de 2025. dirección: https://help.\nfigma.com/\n[35] Microsoft. «Visual Studio Code Documentation,» visitado 14 de dic. de 2025. direc-\nción: https://code.visualstudio.com/docs\n[36] npm Inc. «npm Documentation,» visitado 14 de dic. de 2025. dirección: https://docs.\nnpmjs.com/\n[37] Git SCM. «Git Documentation,» visitado 14 de dic. de 2025. dirección: https://git-\nscm.com/doc\n31\n5 ANEXOS\nEn caso necesario, el documento escrito deberá incluir los anexos y secciones que incorpo-\nran información que sea relevante, pero que, por su extensión, no pueden ser incorporadas\ndirectamente en ninguna de las secciones anteriores. Normalmente, en la sección de Ane-\nxos se incluyen conjuntos de datos extensos, formatos de encuestas, entrevistas, enlaces\nhacia videos o programas que sean producto", "start": 63750, "end": 64650}, {"chunk_id": "c86", "text": "a sección de Ane-\nxos se incluyen conjuntos de datos extensos, formatos de encuestas, entrevistas, enlaces\nhacia videos o programas que sean producto o formen parte del Trabajo de Integración Cu-\nrricular, entre otros.\nEjemplo de Anexos se muestran a continuación:\nANEXO I. Conjunto de Datos Extensos\nANEXO II. Formato de Entrevista\nANEXO III. Enlaces\nLa numeración de los Anexos debe realizarse con números en formato romano.\n32\nANEXO I: APLICACIÓN MOVIL\n33\nANEXO II: APLICACIÓN WEB\n34\nANEXO III: APLICACIÓN PÁGINA WEB\n35", "start": 64500, "end": 65022}]