[{"chunk_id": "c0", "text": "ESCUELA POLITÉCNICA\nNACIONAL\n\nGESTIÓN DE TECNOLOGÍAS DE LA INFORMACIÓN Y COMUNICACIÓN\nTEMA:\nEvaluación de la Gestión de TICs con COBIT 2019\n\nINTEGRANTES:\nAndrade Dilan\nCalahorrano David\nSánchez Hernán\nTarapuéz Galo\nZambrano Andrés\n\nCARRERA:\nRRA Computación\nDOCENTE:\nMSc. Diego Armando Tamayo Urgiles\nResumen ejecutivo\n(Se redactará al finalizar el desarrollo de todas las actividades del proyecto)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIntroducción\n(Se redactará al finalizar el desarrollo de todas las actividades del proyecto)\nTexto\nCaracterización de la empresa\nA continuación, se lleva a cabo una caracterización de la empresa estudiada, que nos ofrece un panorama general de su entorno organizativo, estratégico y tecnológico. Esta caracterización es la que servirá de base para el subsiguiente análisis de la gestión y gobernanza de las Tecnologías de la Información con el marco COBIT 2019.\nLa emp", "start": 0, "end": 900}, {"chunk_id": "c1", "text": "s la que servirá de base para el subsiguiente análisis de la gestión y gobernanza de las Tecnologías de la Información con el marco COBIT 2019.\nLa empresa objeto de estudio corresponde al sector Retail/Comercio, una cadena de tiendas que basa su funcionamiento en los sistemas de información, en la infraestructura tecnológica y en la correcta gestión de las TIC con el fin de asegurar la operativa, la seguridad de la información y la eficiencia de negocio.\nPara efectos de este análisis, se ha generado documentación empresarial completa que caracteriza la organización en sus aspectos estratégicos, operativos, tecnológicos y normativos. A continuación, se presentan los veinte (20) documentos que conforman el inventario de documentación empresarial.\nÍndice de documentos generados\nA continuación, se presenta el índice de los documentos generados como parte de la Actividad 2. Cada documento se", "start": 750, "end": 1650}, {"chunk_id": "c2", "text": "ial.\nÍndice de documentos generados\nA continuación, se presenta el índice de los documentos generados como parte de la Actividad 2. Cada documento se entrega en formato .docx y tiene una extensión aproximada de 2-3 páginas. La numeración corresponde al inventario proporcionado en la guía del proyecto.\nTabla 1. Índice de documentos generados\nNota. La presente tabla lista los veinte (20) documentos empresariales generados para caracterizar la organización retail objeto de estudio, conforme a los requerimientos de la Actividad 2 del proyecto. Cada documento incluye una nota aclarando que ha sido generado con apoyo de inteligencia artificial y revisado para garantizar coherencia y realismo. Se recomienda revisar y actualizar los contenidos periódicamente según evolucione la empresa y sus requerimientos tecnológicos.\nDocumento 1: Descripción General de la Empresa\nLa cadena de tiendas objeto d", "start": 1500, "end": 2400}, {"chunk_id": "c3", "text": "ódicamente según evolucione la empresa y sus requerimientos tecnológicos.\nDocumento 1: Descripción General de la Empresa\nLa cadena de tiendas objeto de estudio opera en el sector retail de productos de consumo masivo, con presencia en múltiples ciudades mediante tiendas físicas y canales digitales. Su misión se centra en proporcionar productos de calidad a precios competitivos con una experiencia de compra segura y eficiente. La organización ha evolucionado desde un negocio familiar hasta convertirse en una cadena mediana con aproximadamente 100 empleados, de los cuales 80 son usuarios directos de servicios tecnológicos (ver Anexo A).\nDocumento 2: Organigrama Organizacional\nLa estructura organizacional responde a un modelo jerárquico funcional con la Gerencia General en la cúspide, de la cual dependen las áreas de Administración y Finanzas, Operaciones, Comercial y Ventas, Logística y Te", "start": 2250, "end": 3150}, {"chunk_id": "c4", "text": "nal con la Gerencia General en la cúspide, de la cual dependen las áreas de Administración y Finanzas, Operaciones, Comercial y Ventas, Logística y Tecnologías de la Información. El Área de TI tiene carácter transversal, prestando servicios a todas las unidades funcionales y manteniendo la infraestructura tecnológica crítica del negocio (ver Anexo B).\nDocumento 3: Plan Estratégico Empresarial\nEl plan estratégico empresarial está orientado hacia el fortalecimiento de la competitividad en el sector retail, la mejora de la eficacia operacional y la sostenibilidad del negocio. Los objetivos principales incluyen el crecimiento controlado de la red de tiendas, la reducción de costos operativos y la mejora de la experiencia del cliente mediante la estandarización de procesos y el uso estratégico de tecnología (ver Anexo C).\nDocumento 4: Plan Estratégico de TI\nEl Plan Estratégico de TI se encuen", "start": 3000, "end": 3900}, {"chunk_id": "c5", "text": "estandarización de procesos y el uso estratégico de tecnología (ver Anexo C).\nDocumento 4: Plan Estratégico de TI\nEl Plan Estratégico de TI se encuentra alineado con el plan empresarial y tiene como objetivo garantizar que las tecnologías soporten adecuadamente los procesos críticos del negocio. Prioriza la alta disponibilidad de sistemas críticos (POS y ERP), el incremento de la seguridad de la información, la mejora en la gestión de infraestructura y la formalización de buenas prácticas basadas en COBIT 2019 (ver Anexo D).\nDocumento 5: Política de Seguridad de la Información\nLa política de seguridad de la información establece los lineamientos institucionales para la protección de datos, sistemas e infraestructura tecnológica. Define controles básicos de seguridad, responsabilidades del personal, procedimientos de gestión de accesos y sanciones por incumplimiento, con el objetivo de r", "start": 3750, "end": 4650}, {"chunk_id": "c6", "text": "troles básicos de seguridad, responsabilidades del personal, procedimientos de gestión de accesos y sanciones por incumplimiento, con el objetivo de reducir riesgos de accesos no autorizados y pérdidas de información (ver Anexo E).\nDocumento 6: Política de Uso de Recursos Tecnológicos\nLa política de uso de recursos tecnológicos define las normas de uso aceptable de equipos, sistemas y servicios de TI. Establece restricciones principales, prohibiciones específicas, responsabilidades de los usuarios y medidas disciplinarias aplicables en caso de uso indebido de los recursos tecnológicos corporativos (ver Anexo F).\nDocumento 7: Inventario de Hardware\nEl inventario de hardware presenta el listado consolidado del equipamiento tecnológico de la empresa, incluyendo servidores principales, estaciones de trabajo, dispositivos de red críticos, terminales POS distribuidos en las sucursales y equipo", "start": 4500, "end": 5400}, {"chunk_id": "c7", "text": "mpresa, incluyendo servidores principales, estaciones de trabajo, dispositivos de red críticos, terminales POS distribuidos en las sucursales y equipos de almacenamiento. Los recursos se encuentran distribuidos entre el centro de datos principal y las sucursales bajo un esquema de gestión centralizada (ver Anexo G).\nDocumento 8: Inventario de Software y Licencias\nEste inventario detalla los sistemas operativos, aplicaciones empresariales principales (ERP, POS), herramientas de productividad y licencias de software utilizadas en la organización. Incluye versiones actuales, vigencias de licenciamiento y plataformas críticas para la operación del negocio retail (ver Anexo H).\nDocumento 9: Arquitectura de Red\nLa arquitectura de red describe la topología implementada, la segmentación de redes (LAN en sucursales, WAN corporativa), los equipos de comunicaciones críticos y el esquema de conectiv", "start": 5250, "end": 6150}, {"chunk_id": "c8", "text": "topología implementada, la segmentación de redes (LAN en sucursales, WAN corporativa), los equipos de comunicaciones críticos y el esquema de conectividad entre sucursales, oficinas administrativas y centro de datos. La red soporta las operaciones en tiempo real requeridas por el negocio retail (ver Anexo I).\nDocumento 10: Catálogo de Servicios de TI\nEl catálogo enumera los servicios tecnológicos principales ofrecidos por el Área de TI a las diferentes unidades de negocio, incluyendo soporte técnico, gestión de accesos, servicios de red, respaldos y recuperación. Especifica niveles de servicio básicos (SLA) y usuarios destinatarios de cada servicio (ver Anexo J).\nDocumento 11: Matriz de Roles y Responsabilidades de TI\nLa matriz define los cargos principales del Área de TI (Gerente de TI, Administradores de Sistemas, Analistas, Técnicos de Soporte), especifica las funciones clave de cada", "start": 6000, "end": 6900}, {"chunk_id": "c9", "text": "argos principales del Área de TI (Gerente de TI, Administradores de Sistemas, Analistas, Técnicos de Soporte), especifica las funciones clave de cada rol, establece responsabilidades asignadas y describe las líneas de reporte dentro de la estructura tecnológica (ver Anexo K).\nDocumento 12: Procedimientos de Gestión de Incidentes\nEl procedimiento describe el flujo completo de atención de incidentes tecnológicos, desde el registro inicial hasta la resolución y cierre. Incluye categorización por impacto y urgencia, niveles de prioridad, procedimientos de escalamiento y tiempos de respuesta esperados según nivel de servicio (ver Anexo L).\nDocumento 13: Procedimientos de Gestión de Cambios\nEl procedimiento establece el proceso formal para solicitar, evaluar, aprobar e implementar cambios en infraestructura, sistemas o servicios de TI. Define criterios de evaluación de riesgos, comités de apro", "start": 6750, "end": 7650}, {"chunk_id": "c10", "text": "tar, evaluar, aprobar e implementar cambios en infraestructura, sistemas o servicios de TI. Define criterios de evaluación de riesgos, comités de aprobación, ventanas de mantenimiento y procedimientos de rollback en caso de fallas (ver Anexo M).\nDocumento 14: Plan de Continuidad de Negocio y DR\nEl plan detalla las estrategias de continuidad operativa y recuperación ante desastres (Disaster Recovery) para sistemas críticos. Especifica objetivos de tiempo de recuperación (RTO), puntos de recuperación (RPO), procedimientos de activación del plan y roles del equipo de respuesta ante contingencias (ver Anexo N).\nDocumento 15: Política de Respaldos\nLa política define la frecuencia de ejecución de respaldos (diarios, semanales, mensuales), los tipos de respaldo implementados (completo, incremental, diferencial), los períodos de retención según tipo de información y las ubicaciones de almacenami", "start": 7500, "end": 8400}, {"chunk_id": "c11", "text": "os de respaldo implementados (completo, incremental, diferencial), los períodos de retención según tipo de información y las ubicaciones de almacenamiento de copias de seguridad (ver Anexo O).\nDocumento 16: Reporte de Cumplimiento Normativo\nEl reporte identifica las normativas legales y regulatorias aplicables al sector retail en el ámbito tecnológico (protección de datos, facturación electrónica, etc.), evalúa el nivel de cumplimiento general de la organización y presenta evidencias principales de conformidad con las regulaciones vigentes (ver Anexo P).\nDocumento 17: Manual de Procedimiento de Operaciones de TI\nEl manual compila los procedimientos operativos resumidos de las diez (10) operaciones de TI seleccionadas: administración de servidores, gestión de bases de datos, gestión de red, soporte técnico, respaldos, seguridad informática, monitoreo de infraestructura, gestión de identid", "start": 8250, "end": 9150}, {"chunk_id": "c12", "text": "idores, gestión de bases de datos, gestión de red, soporte técnico, respaldos, seguridad informática, monitoreo de infraestructura, gestión de identidades y accesos, gestión de sistemas ERP y administración de sistemas POS (ver Anexo Q).\nDocumento 18: Indicadores de Desempeño de TI (KPI)\nEl documento presenta las métricas principales utilizadas para evaluar el desempeño del Área de TI, incluyendo disponibilidad de sistemas, tiempo de resolución de incidentes, cumplimiento de SLA y satisfacción de usuarios. Especifica objetivos cuantitativos y frecuencia de medición de cada indicador (ver Anexo R).\nDocumento 19: Presupuesto de TI\nEl presupuesto detalla la distribución de recursos financieros del Área de TI, discriminando gastos operativos (OPEX), inversiones en capital (CAPEX), mantenimiento de sistemas, licenciamiento de software y proyectos de mejora tecnológica para el período fiscal v", "start": 9000, "end": 9900}, {"chunk_id": "c13", "text": "PEX), inversiones en capital (CAPEX), mantenimiento de sistemas, licenciamiento de software y proyectos de mejora tecnológica para el período fiscal vigente (ver Anexo S).\nDocumento 20: Registro de Activos de Información\nEl registro inventaría los activos críticos de información de la organización (bases de datos, archivos de configuración, información financiera, datos de clientes), establece su clasificación según nivel de confidencialidad, identifica propietarios responsables y describe los controles de seguridad aplicados (ver Anexo T).\n\n\n\nAnálisis de operaciones de TI\nEl presente capítulo desarrolla el análisis de las operaciones de Tecnologías de la Información identificadas como críticas para el funcionamiento de la empresa retail objeto de estudio. Este análisis parte de la selección del giro de negocio, la identificación y justificación de las operaciones de TI relevantes, y cul", "start": 9750, "end": 10650}, {"chunk_id": "c14", "text": "jeto de estudio. Este análisis parte de la selección del giro de negocio, la identificación y justificación de las operaciones de TI relevantes, y culmina con la caracterización del escenario tecnológico que soporta dichas operaciones.\nGiro de negocio seleccionado\nEl giro de negocio seleccionado para el presente proyecto es Retail/Comercio, específicamente una cadena de tiendas, dedicada a la venta de productos al consumidor final mediante locales físicos y canales digitales. Este tipo de empresa se caracteriza por manejar un alto volumen de ventas, controlar inventarios de forma permanente y coordinar operaciones entre múltiples puntos de venta.\nEn este contexto, las Tecnologías de la Información son fundamentales para sostener procesos críticos como los sistemas de punto de venta (POS), la gestión de inventarios, la facturación y el manejo de información. Por esta razón, el sector reta", "start": 10500, "end": 11400}, {"chunk_id": "c15", "text": "íticos como los sistemas de punto de venta (POS), la gestión de inventarios, la facturación y el manejo de información. Por esta razón, el sector retail resulta adecuado para la aplicación del marco COBIT 2019, ya que permite analizar la gestión y el gobierno de TI orientados a la continuidad operativa, la seguridad de la información y la eficiencia del negocio .\nOperaciones de TI seleccionadas\nA partir de la Tabla Matriz de Actividades de Operaciones de TI y considerando el giro de negocio Retail/Comercio, se seleccionaron exactamente diez (10) operaciones de TI que resultan críticas para el funcionamiento y la continuidad del negocio. Estas operaciones fueron elegidas debido a su impacto directo en la gestión de ventas, inventarios, atención al cliente, seguridad de la información y soporte tecnológico de una cadena de tiendas.\nLas operaciones de TI seleccionadas para el análisis son l", "start": 11250, "end": 12150}, {"chunk_id": "c16", "text": "ión al cliente, seguridad de la información y soporte tecnológico de una cadena de tiendas.\nLas operaciones de TI seleccionadas para el análisis son las siguientes:\nTabla 2. Matriz de operaciones de TI seleccionadas para el giro Retail/Comercio\nNota. La tabla presenta las diez (10) operaciones de Tecnologías de la Información seleccionadas para el giro de negocio Retail/Comercio, identificadas a partir de la Tabla Matriz de Actividades de Operaciones de TI. Estas operaciones fueron escogidas por su relevancia directa en la continuidad operativa, la gestión de ventas, el control de inventarios y la seguridad de la información de una cadena de tiendas.\nEstas operaciones constituyen la base tecnológica que permite a la empresa retail operar de manera eficiente, segura y continua, especialmente en entornos con múltiples sucursales y canales digitales, y serán analizadas en profundidad en las", "start": 12000, "end": 12900}, {"chunk_id": "c17", "text": "manera eficiente, segura y continua, especialmente en entornos con múltiples sucursales y canales digitales, y serán analizadas en profundidad en las siguientes actividades del proyecto.\nJustificación de las operaciones de TI\nBase: Actividad 1\nAdministración de servidores\nLa administración de servidores es una operación clave en una empresa de retail, ya que sobre estos se ejecutan sistemas críticos como POS, ERP, bases de datos y plataformas digitales. Una gestión adecuada garantiza la disponibilidad continua de los servicios tecnológicos, evitando interrupciones que podrían afectar las ventas y la atención al cliente .\nGestión de bases de datos\nLa gestión de bases de datos es fundamental para almacenar y procesar información relacionada con ventas, inventarios, clientes y proveedores. En una cadena de tiendas, el acceso oportuno y confiable a los datos permite una toma de decisiones e", "start": 12750, "end": 13650}, {"chunk_id": "c18", "text": "con ventas, inventarios, clientes y proveedores. En una cadena de tiendas, el acceso oportuno y confiable a los datos permite una toma de decisiones eficiente y reduce errores operativos.\nGestión de red LAN/WAN\nLa red LAN/WAN permite la comunicación entre sucursales, centros de distribución y oficinas administrativas. En el sector retail, una red estable y segura es indispensable para sincronizar información en tiempo real, especialmente en empresas con múltiples puntos de venta.\nSoporte técnico a usuarios\nEl soporte técnico a usuarios asegura la correcta operación de los sistemas utilizados por el personal de ventas, administración y logística. Una atención oportuna ante incidentes tecnológicos minimiza tiempos de inactividad y contribuye a mantener la continuidad del negocio.\nGestión de respaldos y recuperación\nLa gestión de respaldos y recuperación de información protege a la empresa", "start": 13500, "end": 14400}, {"chunk_id": "c19", "text": "a mantener la continuidad del negocio.\nGestión de respaldos y recuperación\nLa gestión de respaldos y recuperación de información protege a la empresa frente a pérdidas de datos causadas por fallos técnicos, errores humanos o incidentes de seguridad. En retail, esta operación es crítica para garantizar la recuperación rápida de información financiera y operativa.\nSeguridad informática y ciberseguridad\nLa seguridad informática y la ciberseguridad son esenciales para proteger datos sensibles de clientes, transacciones y sistemas internos. En una empresa retail, la implementación de controles de seguridad reduce riesgos asociados a fraudes, accesos no autorizados y ataques cibernéticos.\nMonitoreo de infraestructura TI\nEl monitoreo de la infraestructura de TI permite detectar fallos, sobrecargas o anomalías antes de que impacten al negocio. Esta operación contribuye a mantener la estabilidad", "start": 14250, "end": 15150}, {"chunk_id": "c20", "text": "tructura de TI permite detectar fallos, sobrecargas o anomalías antes de que impacten al negocio. Esta operación contribuye a mantener la estabilidad de los servicios tecnológicos y a mejorar la capacidad de respuesta ante incidentes.\nGestión de identidades y accesos\nLa gestión de identidades y accesos garantiza que solo el personal autorizado pueda utilizar los sistemas y la información de la empresa. En una cadena de tiendas, esta operación es clave para controlar permisos, reducir riesgos de seguridad y cumplir políticas internas.\nGestión de sistemas ERP\nLos sistemas ERP integran procesos como compras, inventarios, finanzas y logística. En el sector retail, su correcta gestión permite una visión integral del negocio y mejora la eficiencia operativa al centralizar la información en una sola plataforma.\nAdministración de sistemas POS\nLa administración de sistemas POS es crítica para el", "start": 15000, "end": 15900}, {"chunk_id": "c21", "text": "a operativa al centralizar la información en una sola plataforma.\nAdministración de sistemas POS\nLa administración de sistemas POS es crítica para el proceso de venta, ya que estos sistemas registran transacciones, generan facturación y actualizan inventarios. Un funcionamiento adecuado de los POS garantiza rapidez en la atención al cliente y confiabilidad en las operaciones comerciales.\nEstas justificaciones evidencian la relevancia de las operaciones de TI seleccionadas para el giro de negocio retail y sustentan su análisis posterior mediante el marco COBIT 2019 .\nEscenario tecnológico de la empresa\nEl escenario tecnológico de la empresa seleccionada corresponde al de una cadena de tiendas del sector retail que opera mediante múltiples sucursales físicas y canales digitales, lo cual exige una infraestructura de TI robusta, integrada y altamente disponible. Este entorno tecnológico tien", "start": 15750, "end": 16650}, {"chunk_id": "c22", "text": "cursales físicas y canales digitales, lo cual exige una infraestructura de TI robusta, integrada y altamente disponible. Este entorno tecnológico tiene como objetivo principal soportar los procesos críticos del negocio, tales como la venta al consumidor final, la gestión de inventarios, la facturación, la logística y la atención al cliente, garantizando continuidad operativa, seguridad de la información y eficiencia en las operaciones.\nDesde la perspectiva de gobierno y gestión de TI, el escenario tecnológico se concibe como un conjunto interrelacionado de infraestructura tecnológica, tecnologías de información y comunicación (TICs) y sistemas de información, que en conjunto permiten al negocio operar de manera coordinada y alineada con sus objetivos estratégicos. Este enfoque resulta consistente con los principios de COBIT 2019, que promueven la alineación entre TI y el negocio, así com", "start": 16500, "end": 17400}, {"chunk_id": "c23", "text": "objetivos estratégicos. Este enfoque resulta consistente con los principios de COBIT 2019, que promueven la alineación entre TI y el negocio, así como la optimización de recursos tecnológicos.\nInfraestructura de TI\nLa infraestructura de Tecnologías de la Información de la empresa retail está compuesta por servidores, redes, dispositivos de almacenamiento y equipos de usuario final, distribuidos entre un centro de datos principal y las distintas sucursales. Los servidores alojan aplicaciones críticas como los sistemas POS, el ERP corporativo y las bases de datos transaccionales, ya sea en un entorno local, en la nube o bajo un esquema híbrido.\nAsimismo, la infraestructura incluye redes LAN en cada tienda para soportar la operación diaria de los puntos de venta, así como una red WAN que permite la interconexión entre sucursales, oficinas administrativas y centros de distribución. Esta inf", "start": 17250, "end": 18150}, {"chunk_id": "c24", "text": "los puntos de venta, así como una red WAN que permite la interconexión entre sucursales, oficinas administrativas y centros de distribución. Esta infraestructura se complementa con mecanismos de respaldo, recuperación ante desastres y monitoreo continuo, con el fin de asegurar la disponibilidad y confiabilidad de los servicios tecnológicos que soportan el negocio.\nTecnologías de Información y Comunicación (TICs)\nLas Tecnologías de Información y Comunicación (TICs) constituyen el conjunto de herramientas y plataformas que facilitan la comunicación, el acceso a la información y la operación de los procesos del negocio. En el contexto retail, estas tecnologías incluyen sistemas de comunicación interna, servicios de red, herramientas de acceso remoto, plataformas de colaboración y soluciones de seguridad informática.\nLas TICs permiten la transmisión de información en tiempo real entre las s", "start": 18000, "end": 18900}, {"chunk_id": "c25", "text": "remoto, plataformas de colaboración y soluciones de seguridad informática.\nLas TICs permiten la transmisión de información en tiempo real entre las sucursales y los sistemas centrales, posibilitando la actualización inmediata de ventas, inventarios y transacciones. Además, soportan la interacción entre el personal operativo, administrativo y de soporte técnico, contribuyendo a una operación coordinada y eficiente. Su correcta gestión resulta clave para mantener la continuidad del negocio y reducir tiempos de respuesta ante incidentes.\nSistemas de Información\nLos sistemas de información representan el núcleo funcional del escenario tecnológico de la empresa retail. Entre los principales sistemas se encuentran los sistemas de punto de venta (POS), el sistema ERP, los sistemas de gestión de inventarios, las bases de datos corporativas y las plataformas de facturación y reportes.\nEstos sist", "start": 18750, "end": 19650}, {"chunk_id": "c26", "text": "(POS), el sistema ERP, los sistemas de gestión de inventarios, las bases de datos corporativas y las plataformas de facturación y reportes.\nEstos sistemas permiten registrar y procesar las transacciones de venta, controlar el stock de productos, gestionar compras y proveedores, y generar información financiera y operativa para la toma de decisiones. La integración entre los distintos sistemas de información es fundamental para evitar duplicidad de datos, reducir errores y garantizar la consistencia de la información a lo largo de toda la organización.\nRelación entre infraestructura, TICs y sistemas\nLa infraestructura de TI, las TICs y los sistemas de información mantienen una relación de dependencia e integración directa dentro del escenario tecnológico de la empresa. La infraestructura proporciona la base física y lógica sobre la cual operan las TICs y los sistemas, asegurando capacidad", "start": 19500, "end": 20400}, {"chunk_id": "c27", "text": "o tecnológico de la empresa. La infraestructura proporciona la base física y lógica sobre la cual operan las TICs y los sistemas, asegurando capacidad de procesamiento, almacenamiento y conectividad.\nPor su parte, las TICs actúan como el medio que posibilita la comunicación y el intercambio de información entre los distintos componentes tecnológicos y los usuarios del negocio. Finalmente, los sistemas de información utilizan tanto la infraestructura como las TICs para ejecutar los procesos operativos y estratégicos de la empresa. Esta relación integrada permite que la organización funcione de manera eficiente y alineada con sus objetivos, aspecto fundamental dentro del enfoque de COBIT 2019.\nDiagrama conceptual del escenario tecnológico\nEl diagrama conceptual del escenario tecnológico representa de forma gráfica la relación entre la infraestructura de TI, las TICs y los sistemas de infor", "start": 20250, "end": 21150}, {"chunk_id": "c28", "text": "diagrama conceptual del escenario tecnológico representa de forma gráfica la relación entre la infraestructura de TI, las TICs y los sistemas de información dentro de la empresa retail. En este diagrama, la infraestructura se muestra como la base que soporta los servicios tecnológicos, sobre la cual se integran las TICs que facilitan la comunicación y conectividad. A su vez, los sistemas de información se ubican como la capa superior que interactúa directamente con los procesos del negocio, tales como ventas, inventarios, logística y finanzas.\nEste diagrama permite visualizar de manera clara cómo los componentes tecnológicos se interrelacionan para soportar la operación de la cadena de tiendas, y sirve como referencia para el análisis posterior del gobierno y la gestión de TI mediante el marco COBIT 2019.)\n\n\n\n\n\n\n\n\n\nFigura 1. Diagrama conceptual del escenario tecnológico de la empresa ret", "start": 21000, "end": 21900}, {"chunk_id": "c29", "text": "rior del gobierno y la gestión de TI mediante el marco COBIT 2019.)\n\n\n\n\n\n\n\n\n\nFigura 1. Diagrama conceptual del escenario tecnológico de la empresa retail\nInventario de Componentes del Escenario Tecnológico\nA continuación, se presenta el inventario detallado de los componentes tecnológicos que conforman el escenario de la empresa retail, organizados en tres capas principales: Infraestructura de TI, Tecnologías de Información y Comunicación (TICs) y Sistemas de Información. Este inventario establece límites razonables que permiten caracterizar el entorno tecnológico de una cadena de tiendas mediana con aproximadamente 100 empleados y 10 sucursales operativas.\nTabla 3. Texto\nTabla\nNota. Texto\n0 sucursales operativas.\nTabla 4. texto\nTabla\nNota. Texto\nTabla 5. texto\nTabla\nNota. Texto\n\nSíntesis del Escenario Tecnológico\nTexto\nMapeo con COBIT 2019\nEl agrupamiento de operaciones de Tecnologías d", "start": 21750, "end": 22650}, {"chunk_id": "c30", "text": "Texto\nTabla 5. texto\nTabla\nNota. Texto\n\nSíntesis del Escenario Tecnológico\nTexto\nMapeo con COBIT 2019\nEl agrupamiento de operaciones de Tecnologías de la Información (TI) con objetivos de gobernanza y gestión del marco COBIT 2019 constituye una fase principal del presente caso de estudio, ya que permite identificar explícitamente la relación entre las operaciones de TI y el sistema de gobierno que guiaría la forma de controlar, dirigir y evaluar; de acuerdo con las definiciones que nos proporcionan la literatura científica y en particular COBIT 2019.\nDe acuerdo con COBIT 2019, la gobernanza de TI tiene como finalidad asegurar que las Tecnologías de la Información generen valor para el negocio, hagan el mejor uso de los recursos, controlen adecuadamente los riesgos y garanticen el cumplimiento de las regulaciones aplicables, mientras que la gestión de TI hace referencia a la planificació", "start": 22500, "end": 23400}, {"chunk_id": "c31", "text": "adecuadamente los riesgos y garanticen el cumplimiento de las regulaciones aplicables, mientras que la gestión de TI hace referencia a la planificación, construcción, entrega y monitorización de los servicios tecnológicos que soportan los procesos del negocio.\nDe esta forma, el presente agrupamiento se concreta respecto de diez (10) operaciones de TI seleccionadas para la empresa del sector Retail/Comercio, identificándose para cada operación de TI los objetivos de gobernanza de TI y de gestión de TI que se consideran más relevantes. Todo este trabajo permite observar cómo cada operación de TI responde a los objetivos estratégicos del negocio e, incluso, fortalece el sistema de gobierno de TI. el criterio del grupo.\nIdentificación de objetivos COBIT 2019\nBase: Actividad 4\nEl marco de referencia COBIT 2019 define un conjunto estructurado de objetivos de gobernanza y gestión que permiten a", "start": 23250, "end": 24150}, {"chunk_id": "c32", "text": "vos COBIT 2019\nBase: Actividad 4\nEl marco de referencia COBIT 2019 define un conjunto estructurado de objetivos de gobernanza y gestión que permiten a las organizaciones establecer, dirigir y controlar de manera efectiva el uso de las Tecnologías de la Información. Estos objetivos constituyen la base del sistema de gobierno de TI y facilitan la alineación entre las capacidades tecnológicas y los objetivos estratégicos del negocio, promoviendo la creación de valor, la optimización de riesgos y el uso eficiente de los recursos.\nDe acuerdo con COBIT 2019, los objetivos se organizan en objetivos de gobernanza, agrupados en el dominio EDM, y objetivos de gestión, distribuidos en los dominios APO, BAI, DSS y MEA. Esta clasificación responde al principio de separación entre gobernanza y gestión, garantizando que las responsabilidades estratégicas y operativas estén claramente diferenciadas.\nObj", "start": 24000, "end": 24900}, {"chunk_id": "c33", "text": "incipio de separación entre gobernanza y gestión, garantizando que las responsabilidades estratégicas y operativas estén claramente diferenciadas.\nObjetivos de Gobernanza – Dominio EDM (Evaluar, Dirigir y Monitorear)\nEl dominio EDM reúne los objetivos de gobernanza que son responsabilidad del nivel directivo de la organización y que buscan asegurar que el uso de las Tecnologías de la Información esté alineado con los objetivos empresariales y las expectativas de las partes interesadas.\nLos objetivos de gobernanza considerados para el presente estudio son:\nEDM02 – Asegurar la entrega de beneficios\nEste objetivo permite garantizar que las inversiones y servicios de TI generen beneficios tangibles para la organización, asegurando que la tecnología contribuya de manera efectiva al logro de los objetivos estratégicos del negocio.\nEDM03 – Asegurar la optimización del riesgo\nOrientado a asegura", "start": 24750, "end": 25650}, {"chunk_id": "c34", "text": "ogía contribuya de manera efectiva al logro de los objetivos estratégicos del negocio.\nEDM03 – Asegurar la optimización del riesgo\nOrientado a asegurar que los riesgos asociados al uso de las Tecnologías de la Información sean identificados, evaluados y gestionados dentro de los niveles de tolerancia definidos por la organización.\nEDM04 – Asegurar la optimización de los recursos\nBusca garantizar el uso eficiente y responsable de los recursos de TI, incluyendo infraestructura, aplicaciones, información y talento humano, en función de las prioridades del negocio.\nEstos objetivos proporcionan el marco estratégico dentro del cual se gobiernan las Tecnologías de la Información de la empresa objeto de estudio.\nObjetivos de Gestión – Dominios APO, BAI, DSS y MEA\nLos objetivos de gestión de COBIT 2019 se enfocan en la planificación, implementación, operación y monitoreo de las Tecnologías de la", "start": 25500, "end": 26400}, {"chunk_id": "c35", "text": "BAI, DSS y MEA\nLos objetivos de gestión de COBIT 2019 se enfocan en la planificación, implementación, operación y monitoreo de las Tecnologías de la Información, siendo responsabilidad de la gerencia y del área de TI. Estos objetivos permiten asegurar que los servicios tecnológicos se entreguen de forma eficiente, segura y alineada con las necesidades del negocio.\nDominio APO (Alinear, Planificar y Organizar)\nAPO12 – Gestionar el riesgo\nPermite establecer un enfoque sistemático para la identificación, análisis y tratamiento de los riesgos relacionados con las Tecnologías de la Información.\nAPO13 – Gestionar la seguridad\nOrientado a definir y mantener un sistema de gestión de la seguridad de la información que proteja los activos tecnológicos y la información de la organización.\nDominio BAI (Construir, Adquirir e Implementar)\nBAI03 – Gestionar la identificación y construcción de solucion", "start": 26250, "end": 27150}, {"chunk_id": "c36", "text": "os y la información de la organización.\nDominio BAI (Construir, Adquirir e Implementar)\nBAI03 – Gestionar la identificación y construcción de soluciones\nFacilita la implementación de soluciones tecnológicas que respondan a los requerimientos del negocio y se integren adecuadamente al entorno organizacional.\nBAI04 – Gestionar la disponibilidad y la capacidad\nAsegura que los recursos tecnológicos cuenten con la capacidad y disponibilidad necesarias para soportar la operación continua de la organización.\nDominio DSS (Entregar, Dar Servicio y Soporte)\nDSS01 – Gestionar las operaciones\nSe enfoca en la ejecución eficiente de las operaciones diarias de TI, garantizando la estabilidad y confiabilidad de los servicios tecnológicos.\nDSS02 – Gestionar las peticiones y los incidentes del servicio\nPermite atender de manera estructurada las solicitudes e incidentes de los usuarios, reduciendo el impac", "start": 27000, "end": 27900}, {"chunk_id": "c37", "text": "las peticiones y los incidentes del servicio\nPermite atender de manera estructurada las solicitudes e incidentes de los usuarios, reduciendo el impacto de interrupciones en la operación.\nDSS04 – Gestionar la continuidad\nOrientado a asegurar la resiliencia del negocio mediante la definición de mecanismos de continuidad y recuperación ante eventos disruptivos.\nDSS05 – Gestionar los servicios de seguridad\nBusca proteger los servicios de TI y la información frente a amenazas internas y externas, garantizando su confidencialidad, integridad y disponibilidad.\nDominio MEA (Monitorear, Evaluar y Valorar)\nMEA01 – Gestionar el monitoreo del rendimiento y la conformidad\nPermite evaluar de manera continua el desempeño de los servicios de TI y su conformidad con los objetivos y requisitos establecidos por la organización.\nLa identificación de estos objetivos de gobernanza y gestión constituye la bas", "start": 27750, "end": 28650}, {"chunk_id": "c38", "text": "rmidad con los objetivos y requisitos establecidos por la organización.\nLa identificación de estos objetivos de gobernanza y gestión constituye la base para el mapeo detallado de las operaciones de TI que se desarrollará en las siguientes secciones, asegurando coherencia con los principios y lineamientos establecidos por el marco COBIT 2019.\nMapeo de operaciones de TI con dominios COBIT\nBase: Actividad 4\n4.2 Mapeo de operaciones de TI con dominios COBIT\nEn esta sección se establece la relación entre las operaciones de Tecnologías de la Información seleccionadas para la empresa del sector Retail/Comercio y los dominios de COBIT 2019 a los que pertenecen. Este mapeo permite clasificar cada operación de TI dentro del marco de gobernanza y gestión definido por COBIT, facilitando la posterior identificación de los objetivos específicos de gobernanza y gestión asociados.\nDe acuerdo con COBIT 2", "start": 28500, "end": 29400}, {"chunk_id": "c39", "text": "ión definido por COBIT, facilitando la posterior identificación de los objetivos específicos de gobernanza y gestión asociados.\nDe acuerdo con COBIT 2019, los dominios representan grandes áreas funcionales del sistema de gobierno de TI y reflejan el ciclo de vida de la gestión tecnológica, desde la dirección estratégica hasta la operación y el monitoreo. En este punto, el análisis se realiza únicamente a nivel de dominios, sin descender aún al nivel de objetivos específicos, en concordancia con la estructura definida en la guía del proyecto.\nRelación de operaciones de TI con los dominios COBIT 2019\nA continuación, se describe la relación entre cada una de las diez (10) operaciones de TI seleccionadas y los dominios COBIT correspondientes, considerando la naturaleza y el propósito de cada operación dentro de la organización.\nAdministración de servidores\nEsta operación se relaciona princip", "start": 29250, "end": 30150}, {"chunk_id": "c40", "text": "onsiderando la naturaleza y el propósito de cada operación dentro de la organización.\nAdministración de servidores\nEsta operación se relaciona principalmente con el dominio DSS (Entregar, Dar Servicio y Soporte), ya que forma parte de la operación diaria de los servicios tecnológicos, asegurando su disponibilidad y estabilidad. Adicionalmente, mantiene relación con el dominio BAI (Construir, Adquirir e Implementar), debido a las actividades asociadas a la configuración, actualización y mejora de la infraestructura de servidores.\nGestión de bases de datos\nLa gestión de bases de datos se vincula con el dominio DSS, al estar orientada a la operación continua, respaldo y soporte de la información utilizada por los sistemas del negocio. Asimismo, se relaciona con el dominio BAI, debido a la implementación y mantenimiento de estructuras de datos que soportan las aplicaciones empresariales.\nGes", "start": 30000, "end": 30900}, {"chunk_id": "c41", "text": ", se relaciona con el dominio BAI, debido a la implementación y mantenimiento de estructuras de datos que soportan las aplicaciones empresariales.\nGestión de red LAN/WAN\nEsta operación se asocia al dominio DSS, dado que garantiza la conectividad y comunicación entre sucursales, oficinas administrativas y sistemas centrales. De manera complementaria, se vincula con el dominio BAI, en lo referente a la implementación y mejora de la arquitectura de red.\nSoporte técnico a usuarios\nEl soporte técnico a usuarios se enmarca directamente dentro del dominio DSS, ya que está orientado a la atención de solicitudes e incidentes relacionados con el uso de los servicios tecnológicos, contribuyendo a la continuidad operativa del negocio.\nGestión de respaldos y recuperación de información\nEsta operación se relaciona principalmente con el dominio DSS, al formar parte de las actividades de continuidad ope", "start": 30750, "end": 31650}, {"chunk_id": "c42", "text": "dos y recuperación de información\nEsta operación se relaciona principalmente con el dominio DSS, al formar parte de las actividades de continuidad operativa y recuperación ante fallos. Además, mantiene relación con el dominio MEA (Monitorear, Evaluar y Valorar), dado que requiere controles y evaluaciones periódicas sobre la efectividad de los mecanismos de respaldo y recuperación.\nSeguridad informática y ciberseguridad\nLa seguridad informática se vincula con el dominio APO (Alinear, Planificar y Organizar), debido a la definición de políticas, lineamientos y controles de seguridad, y con el dominio DSS, al involucrar la operación continua de mecanismos de protección y respuesta ante incidentes de seguridad.\nMonitoreo de infraestructura de TI\nEsta operación se asocia al dominio MEA, ya que implica la evaluación continua del desempeño, disponibilidad y cumplimiento de los servicios tecnoló", "start": 31500, "end": 32400}, {"chunk_id": "c43", "text": "I\nEsta operación se asocia al dominio MEA, ya que implica la evaluación continua del desempeño, disponibilidad y cumplimiento de los servicios tecnológicos. Asimismo, mantiene relación con el dominio DSS, al apoyar la detección temprana de fallos en la operación diaria.\nGestión de identidades y accesos\nLa gestión de identidades y accesos se relaciona con el dominio APO, al estar vinculada con la definición de políticas y controles de acceso, y con el dominio DSS, debido a la operación diaria de los mecanismos de autenticación y autorización.\nGestión de sistemas ERP\nLa gestión de sistemas ERP se vincula con el dominio BAI, ya que involucra la implementación, mantenimiento y mejora de una solución tecnológica crítica para el negocio. Adicionalmente, se relaciona con el dominio DSS, al asegurar la operación continua y el soporte de este sistema.\nAdministración de sistemas POS\nEsta operación", "start": 32250, "end": 33150}, {"chunk_id": "c44", "text": "lmente, se relaciona con el dominio DSS, al asegurar la operación continua y el soporte de este sistema.\nAdministración de sistemas POS\nEsta operación se asocia con el dominio DSS, debido a su carácter operativo y su impacto directo en la continuidad del proceso de ventas. Asimismo, se relaciona con el dominio BAI, en lo referente a la implementación, actualización y mejora de los sistemas de punto de venta.\n\nRelación operaciones de TI y objetivos de gobernanzas y gestión\nBase: Actividad 4\nEn este apartado se establece la relación entre las operaciones de Tecnologías de la Información identificadas y los objetivos de gobernanza y gestión de COBIT 2019 previamente seleccionados. Este análisis permite evidenciar cómo cada operación de TI contribuye al cumplimiento de los principios de gobierno corporativo de TI, así como a la gestión eficiente, segura y alineada con los objetivos del negoc", "start": 33000, "end": 33900}, {"chunk_id": "c45", "text": "ribuye al cumplimiento de los principios de gobierno corporativo de TI, así como a la gestión eficiente, segura y alineada con los objetivos del negocio.\nDe acuerdo con COBIT 2019, los objetivos de gobernanza (EDM) garantizan que las decisiones estratégicas relacionadas con TI se orienten a la creación de valor, la optimización del riesgo y el uso eficiente de los recursos, mientras que los objetivos de gestión (APO, BAI, DSS y MEA) aseguran la correcta planificación, implementación, operación y monitoreo de los servicios tecnológicos. A continuación, se presenta el mapeo detallado para cada una de las operaciones de TI consideradas.\nAdministración de servidores\nObjetivos de Gobernanza\nEDM02 – Asegurar la entrega de beneficios, ya que la correcta administración de servidores garantiza que la infraestructura tecnológica soporte de manera eficiente los procesos críticos del negocio.\nEDM04", "start": 33750, "end": 34650}, {"chunk_id": "c46", "text": "rrecta administración de servidores garantiza que la infraestructura tecnológica soporte de manera eficiente los procesos críticos del negocio.\nEDM04 – Asegurar la optimización de los recursos, debido a que una gestión adecuada de los servidores permite un uso eficiente de la capacidad instalada y de los recursos tecnológicos.\nObjetivos de Gestión\nBAI04 – Gestionar la disponibilidad y la capacidad, al asegurar que los servidores cuenten con la capacidad necesaria para soportar la operación continua.\nDSS01 – Gestionar las operaciones, debido a que la administración de servidores forma parte de las actividades operativas diarias de TI.\nMEA01 – Gestionar el monitoreo del rendimiento y la conformidad, al evaluar de manera continua el desempeño y disponibilidad de la infraestructura.\nGestión de bases de datos\nObjetivos de Gobernanza\nEDM02 – Asegurar la entrega de beneficios, al garantizar la", "start": 34500, "end": 35400}, {"chunk_id": "c47", "text": "y disponibilidad de la infraestructura.\nGestión de bases de datos\nObjetivos de Gobernanza\nEDM02 – Asegurar la entrega de beneficios, al garantizar la disponibilidad y confiabilidad de la información utilizada por los sistemas del negocio.\nEDM03 – Asegurar la optimización del riesgo, considerando los riesgos asociados a la pérdida, corrupción o acceso no autorizado a la información.\nObjetivos de Gestión\nBAI03 – Gestionar la identificación y construcción de soluciones, relacionado con la implementación y mantenimiento de las estructuras de datos.\nDSS01 – Gestionar las operaciones, al tratarse de una actividad operativa continua.\nDSS05 – Gestionar los servicios de seguridad, debido a la necesidad de proteger la integridad y confidencialidad de los datos.\nGestión de red LAN/WAN\nObjetivos de Gobernanza\nEDM02 – Asegurar la entrega de beneficios, al soportar la conectividad requerida para las o", "start": 35250, "end": 36150}, {"chunk_id": "c48", "text": "los datos.\nGestión de red LAN/WAN\nObjetivos de Gobernanza\nEDM02 – Asegurar la entrega de beneficios, al soportar la conectividad requerida para las operaciones del negocio.\nEDM04 – Asegurar la optimización de los recursos, mediante el uso eficiente de la infraestructura de red.\nObjetivos de Gestión\nBAI04 – Gestionar la disponibilidad y la capacidad, garantizando el desempeño adecuado de la red.\nDSS01 – Gestionar las operaciones, al asegurar la continuidad de los servicios de conectividad.\nMEA01 – Gestionar el monitoreo del rendimiento y la conformidad, mediante la supervisión constante del estado de la red.\nSoporte técnico a usuarios\nObjetivos de Gobernanza\nEDM02 – Asegurar la entrega de beneficios, al contribuir directamente a la continuidad de las operaciones del negocio.\nEDM03 – Asegurar la optimización del riesgo, al reducir el impacto de incidentes tecnológicos en los usuarios.\nObj", "start": 36000, "end": 36900}, {"chunk_id": "c49", "text": "dad de las operaciones del negocio.\nEDM03 – Asegurar la optimización del riesgo, al reducir el impacto de incidentes tecnológicos en los usuarios.\nObjetivos de Gestión\nDSS02 – Gestionar las peticiones y los incidentes del servicio, objetivo directamente asociado a la atención de usuarios.\nDSS01 – Gestionar las operaciones, al formar parte de la gestión operativa diaria de TI.\nMEA01 – Gestionar el monitoreo del rendimiento y la conformidad, evaluando tiempos de respuesta y niveles de servicio.\n\nGestión de respaldos y recuperación de información\nObjetivos de Gobernanza\nEDM03 – Asegurar la optimización del riesgo, al mitigar los riesgos asociados a la pérdida de información.\nEDM02 – Asegurar la entrega de beneficios, asegurando la continuidad de los procesos críticos del negocio.\nObjetivos de Gestión\nDSS04 – Gestionar la continuidad, al garantizar la recuperación de la información ante inci", "start": 36750, "end": 37650}, {"chunk_id": "c50", "text": "de los procesos críticos del negocio.\nObjetivos de Gestión\nDSS04 – Gestionar la continuidad, al garantizar la recuperación de la información ante incidentes.\nDSS01 – Gestionar las operaciones, por tratarse de una actividad operativa recurrente.\nMEA01 – Gestionar el monitoreo del rendimiento y la conformidad, mediante la verificación periódica de los respaldos.\nSeguridad informática y ciberseguridad\nObjetivos de Gobernanza\nEDM03 – Asegurar la optimización del riesgo, al gestionar los riesgos de seguridad de la información.\nEDM04 – Asegurar la optimización de los recursos, asegurando que las inversiones en seguridad sean adecuadas y eficientes.\nObjetivos de Gestión\nAPO13 – Gestionar la seguridad, al establecer políticas y controles de seguridad.\nDSS05 – Gestionar los servicios de seguridad, mediante la operación de mecanismos de protección.\nMEA01 – Gestionar el monitoreo del rendimiento y", "start": 37500, "end": 38400}, {"chunk_id": "c51", "text": "ad.\nDSS05 – Gestionar los servicios de seguridad, mediante la operación de mecanismos de protección.\nMEA01 – Gestionar el monitoreo del rendimiento y la conformidad, evaluando la efectividad de los controles de seguridad.\n\nMonitoreo de infraestructura de TI\nObjetivos de Gobernanza\nEDM02 – Asegurar la entrega de beneficios, al garantizar la estabilidad y disponibilidad de los servicios tecnológicos.\nEDM03 – Asegurar la optimización del riesgo, al identificar oportunamente fallos o desviaciones.\nObjetivos de Gestión\nMEA01 – Gestionar el monitoreo del rendimiento y la conformidad, como objetivo principal.\nDSS01 – Gestionar las operaciones, al apoyar la operación continua de la infraestructura.\nGestión de identidades y accesos\nObjetivos de Gobernanza\nEDM03 – Asegurar la optimización del riesgo, controlando el acceso a los activos de información.\nEDM04 – Asegurar la optimización de los recurs", "start": 38250, "end": 39150}, {"chunk_id": "c52", "text": "rnanza\nEDM03 – Asegurar la optimización del riesgo, controlando el acceso a los activos de información.\nEDM04 – Asegurar la optimización de los recursos, al gestionar adecuadamente los perfiles y privilegios de acceso.\nObjetivos de Gestión\nAPO13 – Gestionar la seguridad, al definir políticas de acceso.\nDSS05 – Gestionar los servicios de seguridad, al operar los mecanismos de autenticación y autorización.\nDSS01 – Gestionar las operaciones, como parte de la gestión diaria de accesos.\n\nGestión de sistemas ERP\nObjetivos de Gobernanza\nEDM02 – Asegurar la entrega de beneficios, al tratarse de un sistema crítico para la gestión del negocio.\nEDM04 – Asegurar la optimización de los recursos, garantizando el uso eficiente de la plataforma ERP.\nObjetivos de Gestión\nBAI03 – Gestionar la identificación y construcción de soluciones, relacionado con la implementación y mejoras del ERP.\nDSS01 – Gestiona", "start": 39000, "end": 39900}, {"chunk_id": "c53", "text": "vos de Gestión\nBAI03 – Gestionar la identificación y construcción de soluciones, relacionado con la implementación y mejoras del ERP.\nDSS01 – Gestionar las operaciones, asegurando la continuidad del sistema.\nMEA01 – Gestionar el monitoreo del rendimiento y la conformidad, evaluando el desempeño del ERP.\nAdministración de sistemas POS\nObjetivos de Gobernanza\nEDM02 – Asegurar la entrega de beneficios, dado su impacto directo en el proceso de ventas.\nEDM03 – Asegurar la optimización del riesgo, minimizando interrupciones en la operación comercial.\nObjetivos de Gestión\nBAI03 – Gestionar la identificación y construcción de soluciones, en relación con la implementación y actualización de los POS.\nDSS01 – Gestionar las operaciones, al asegurar el funcionamiento diario de los sistemas de punto de venta.\nDSS04 – Gestionar la continuidad, para garantizar la disponibilidad del servicio ante inciden", "start": 39750, "end": 40650}, {"chunk_id": "c54", "text": "funcionamiento diario de los sistemas de punto de venta.\nDSS04 – Gestionar la continuidad, para garantizar la disponibilidad del servicio ante incidentes.\n\nDiagramas y tablas de mapeo COBIT\nBase: Actividad 4\nLos diagramas y tablas presentados a continuación representan de forma gráfica y estructurada el mapeo realizado entre las operaciones de Tecnologías de la Información y los objetivos de gobernanza y gestión definidos en COBIT 2019.\nCada diagrama corresponde a una operación de TI y permite visualizar su alineación con los objetivos de gobernanza (EDM), los objetivos de gestión (APO, BAI, DSS, MEA) y los componentes tecnológicos asociados, tales como infraestructura, TICs y sistemas de información.\nAdministración de servidores\n\nIlustración 1Diagrama de mapeo COBIT 2019 de la operación Administración de servidores\nGestión de bases de datos\n\nIlustración 2Diagrama de mapeo COBIT 2019 de", "start": 40500, "end": 41400}, {"chunk_id": "c55", "text": "ón 1Diagrama de mapeo COBIT 2019 de la operación Administración de servidores\nGestión de bases de datos\n\nIlustración 2Diagrama de mapeo COBIT 2019 de la operación Gestión de bases de datos\nGestión de red LAN/WAN\n\nIlustración 3Diagrama de mapeo COBIT 2019 de la operación Gestión de red LAN/WAN\nSoporte técnico a usuarios\n\nIlustración 4Diagrama de mapeo COBIT 2019 de la operación Soporte técnico a usuarios\nGestión de respaldos y recuperación\n\nIlustración 5Diagrama de mapeo COBIT 2019 de la operación Gestión de respaldos y recuperación de información\nSeguridad informática y ciberseguridad\n\nMonitoreo de infraestructura de TI\n\nGestión de identidades y accesos\n\nGestión de sistemas ERP\n\nAdministración de sistemas POS\n\nTabla resumen general\nTabla 6Resumen del mapeo de operaciones de TI con objetivos de gobernanza y gestión COBIT 2019\n\n\nEvaluación de cumplimiento y madurez\nBase: Actividad 5\nNota:", "start": 41250, "end": 42150}, {"chunk_id": "c56", "text": "esumen del mapeo de operaciones de TI con objetivos de gobernanza y gestión COBIT 2019\n\n\nEvaluación de cumplimiento y madurez\nBase: Actividad 5\nNota: Esta sección es únicamente una base de referencia; puede mantenerse, ajustarse o modificarse según el criterio del grupo.\nTexto (aquí se reemplaza por el contenido correspondiente de la actividad)\nCriterios de evaluación de madurez\nBase: Actividad 5\nTexto (aquí se reemplaza por el contenido correspondiente de la actividad)\nEvaluación del nivel de madurez de las operaciones de TI\nBase: Actividad 5\nTexto (aquí se reemplaza por el contenido correspondiente de la actividad)\nAnálisis de cumplimiento y brechas (GAP)\nBase: Actividad 5\nTexto (aquí se reemplaza por el contenido correspondiente de la actividad)\nResultados de la evaluación\nBase: Actividad 5\nTexto (aquí se reemplaza por el contenido correspondiente de la actividad)\nTexto\nConclusiones y", "start": 42000, "end": 42900}, {"chunk_id": "c57", "text": "tividad)\nResultados de la evaluación\nBase: Actividad 5\nTexto (aquí se reemplaza por el contenido correspondiente de la actividad)\nTexto\nConclusiones y recomendaciones\nBase: El contenido es una base referencial y podrá ajustarse o modificarse una vez finalizadas las actividades 1 a la 5.\nTexto (aquí se reemplaza por las conclusiones y recomendaciones generales del proyecto, basadas en los resultados de las actividades 1 a la 5; esta sección puede ser desarrollada por cualquier integrante del grupo)\nConclusiones\nTexto (aquí se reemplaza por las conclusiones generales y, cuando corresponda, conclusiones específicas derivadas del análisis y evaluación realizada)\nRecomendaciones\nTexto (aquí se reemplaza por recomendaciones generales y específicas orientadas a la mejora de la gestión de TI)\nAnexos\n01_Descripcion_General_de_la_Empresa\nDescripción: Presenta la información institucional básica de", "start": 42750, "end": 43650}, {"chunk_id": "c58", "text": "s orientadas a la mejora de la gestión de TI)\nAnexos\n01_Descripcion_General_de_la_Empresa\nDescripción: Presenta la información institucional básica de la empresa retail, incluyendo misión, visión, valores corporativos, reseña histórica, estructura organizacional y descripción del giro de negocio.\n\n02_Organigrama_Organizacional\nDescripción: Detalla la estructura jerárquica completa de la organización, identificando las áreas funcionales principales, líneas de reporte y la ubicación del Área de Tecnologías de la Información dentro de la estructura corporativa.\n\n03_Plan_Estrategico_Empresarial\nDescripción: Expone los objetivos estratégicos principales de la organización para el período 2026-2028, las metas organizacionales prioritarias y los indicadores clave de desempeño (KPI) empresariales.\n\n04_Plan_Estrategico_de_TI\nDescripción: Define las iniciativas tecnológicas prioritarias alineadas", "start": 43500, "end": 44400}, {"chunk_id": "c59", "text": "ndicadores clave de desempeño (KPI) empresariales.\n\n04_Plan_Estrategico_de_TI\nDescripción: Define las iniciativas tecnológicas prioritarias alineadas con los objetivos empresariales, el roadmap de implementación de proyectos de TI y las metas específicas del área tecnológica.\n\n05_Politica_de_Seguridad_de_la_Informacion\nDescripción: Establece los lineamientos institucionales para la protección de la información, los controles de seguridad básicos implementados, las responsabilidades del personal y las sanciones por incumplimiento.\n\n06_Politica_de_Uso_de_Recursos_Tecnologicos\nDescripción: Define las normas de uso aceptable de los recursos tecnológicos de la empresa, las restricciones principales de acceso y uso, y las medidas disciplinarias aplicables.\n\n07_Inventario_de_Hardware\nDescripción: Presenta el listado consolidado de equipamiento tecnológico de la empresa, incluyendo servidores, e", "start": 44250, "end": 45150}, {"chunk_id": "c60", "text": "plicables.\n\n07_Inventario_de_Hardware\nDescripción: Presenta el listado consolidado de equipamiento tecnológico de la empresa, incluyendo servidores, estaciones de trabajo, dispositivos de red críticos, terminales POS y equipos de almacenamiento.\n\n08_Inventario_de_Software_y_Licencias\nDescripción: Detalla los sistemas operativos, aplicaciones empresariales, herramientas de productividad y licencias de software utilizadas en la organización, con sus respectivas versiones y vigencias.\n\n09_Arquitectura_de_Red\nDescripción: Describe la topología general de red de la empresa, la segmentación implementada, los equipos de comunicaciones críticos y el esquema de conectividad entre sucursales y oficinas administrativas.\n\n10_Catalogo_de_Servicios_de_TI\nDescripción: Enumera los servicios tecnológicos principales ofrecidos por el Área de TI a las diferentes unidades de negocio, los niveles de servicio", "start": 45000, "end": 45900}, {"chunk_id": "c61", "text": "Descripción: Enumera los servicios tecnológicos principales ofrecidos por el Área de TI a las diferentes unidades de negocio, los niveles de servicio básicos (SLA) y los usuarios destinatarios de cada servicio.\n\n11_Matriz_de_Roles_y_Responsabilidades_de_TI\nDescripción: Define los cargos principales del Área de Tecnologías de la Información, especifica las funciones clave de cada rol, establece las responsabilidades asignadas y describe las líneas de reporte dentro de la estructura de TI.\n\n12_Procedimiento_de_Gestion_de_Incidentes\nDescripción: Describe el flujo de atención de incidentes tecnológicos, desde el registro inicial hasta la resolución y cierre. Incluye categorización de incidentes, niveles de prioridad, procedimientos de escalamiento y tiempos de respuesta esperados.\n\n13_Procedimiento_de_Gestion_de_Cambios\nDescripción: Establece el proceso formal para solicitar, evaluar, aprob", "start": 45750, "end": 46650}, {"chunk_id": "c62", "text": "ento y tiempos de respuesta esperados.\n\n13_Procedimiento_de_Gestion_de_Cambios\nDescripción: Establece el proceso formal para solicitar, evaluar, aprobar e implementar cambios en la infraestructura, sistemas o servicios de TI. Define criterios de aprobación, comités responsables y procedimientos de rollback en caso de fallas.\n\n14_Plan_de_Continuidad_de_Negocio_y_DR\nDescripción: Detalla las estrategias de continuidad operativa y recuperación ante desastres (Disaster Recovery), especifica objetivos de tiempo de recuperación (RTO) y punto de recuperación (RPO), e incluye los procedimientos principales de activación del plan.\n\n15_Politica_de_Respaldos\nDescripción: Define la frecuencia de ejecución de respaldos de información crítica, los tipos de respaldo implementados (completo, incremental, diferencial), los períodos de retención y las ubicaciones de almacenamiento de las copias de segurida", "start": 46500, "end": 47400}, {"chunk_id": "c63", "text": "e respaldo implementados (completo, incremental, diferencial), los períodos de retención y las ubicaciones de almacenamiento de las copias de seguridad.\n\n16_Reporte_de_Cumplimiento_Normativo\nDescripción: Identifica las normativas legales y regulatorias aplicables al sector retail en el ámbito tecnológico, evalúa el nivel de cumplimiento general de la organización y presenta las evidencias principales de conformidad.\n\n17_Manual_de_Procedimientos_de_Operaciones_de_TI\nDescripción: Compila los procedimientos operativos resumidos de las diez (10) operaciones de TI seleccionadas para este proyecto: administración de servidores, gestión de bases de datos, redes, soporte técnico, respaldos, seguridad, monitoreo, identidades, ERP y sistemas POS.\n\n18_Indicadores_de_Desempeño_de_TI\nDescripción: Presenta las métricas principales utilizadas para evaluar el desempeño del Área de Tecnologías de la Info", "start": 47250, "end": 48150}, {"chunk_id": "c64", "text": "_Indicadores_de_Desempeño_de_TI\nDescripción: Presenta las métricas principales utilizadas para evaluar el desempeño del Área de Tecnologías de la Información, especifica los objetivos cuantitativos establecidos y define la frecuencia de medición y reporte de cada indicador.\n\n19_Presupuesto_de_TI\nDescripción: Detalla la distribución presupuestaria del Área de Tecnologías de la Información, discriminando gastos operativos (OPEX), inversiones en capital (CAPEX), mantenimiento de sistemas y licenciamiento de software para el período fiscal vigente.\n\n20_Registro_de_Activos_de_Informacion\nDescripción: Inventaría los activos críticos de información de la organización, establece su clasificación según nivel de confidencialidad, identifica a los propietarios responsables y describe los controles de seguridad aplicados a cada tipo de activo.", "start": 48000, "end": 48843}, {"chunk_id": "c65", "text": "pietarios responsables y describe los controles de seguridad aplicados a cada tipo de activo.", "start": 48750, "end": 48843}]